
zig-cache/bin/main:     file format elf32-littlearm


Disassembly of section .stack_top:

08000000 <.stack_top>:
 8000000:	20004ff8 	strdcs	r4, [r0], -r8

Disassembly of section .system_exceptions_vector_table:

08000004 <vector_table>:
 8000004:	080000d9 	stmdaeq	r0, {r0, r3, r4, r6, r7}
 8000008:	080001a7 	stmdaeq	r0, {r0, r1, r2, r5, r7, r8}
 800000c:	080001a7 	stmdaeq	r0, {r0, r1, r2, r5, r7, r8}
 8000010:	080001a7 	stmdaeq	r0, {r0, r1, r2, r5, r7, r8}
 8000014:	080001a7 	stmdaeq	r0, {r0, r1, r2, r5, r7, r8}
 8000018:	080001a7 	stmdaeq	r0, {r0, r1, r2, r5, r7, r8}
	...
 800002c:	080001ab 	stmdaeq	r0, {r0, r1, r3, r5, r7, r8}
 8000030:	080001ab 	stmdaeq	r0, {r0, r1, r3, r5, r7, r8}
 8000034:	00000000 	andeq	r0, r0, r0
 8000038:	080001ab 	stmdaeq	r0, {r0, r1, r3, r5, r7, r8}
 800003c:	080001ab 	stmdaeq	r0, {r0, r1, r3, r5, r7, r8}
 8000040:	080001ab 	stmdaeq	r0, {r0, r1, r3, r5, r7, r8}
 8000044:	080001ab 	stmdaeq	r0, {r0, r1, r3, r5, r7, r8}
 8000048:	080001ab 	stmdaeq	r0, {r0, r1, r3, r5, r7, r8}
 800004c:	080001ab 	stmdaeq	r0, {r0, r1, r3, r5, r7, r8}
 8000050:	080001ab 	stmdaeq	r0, {r0, r1, r3, r5, r7, r8}
 8000054:	080001ab 	stmdaeq	r0, {r0, r1, r3, r5, r7, r8}
 8000058:	080001ab 	stmdaeq	r0, {r0, r1, r3, r5, r7, r8}
 800005c:	080001ab 	stmdaeq	r0, {r0, r1, r3, r5, r7, r8}
 8000060:	080001ab 	stmdaeq	r0, {r0, r1, r3, r5, r7, r8}
 8000064:	080001ab 	stmdaeq	r0, {r0, r1, r3, r5, r7, r8}
 8000068:	080001ab 	stmdaeq	r0, {r0, r1, r3, r5, r7, r8}

    DW_AT_decl_file    DW_FORM_data1
    DW_AT_decl_line    DW_FORM_data1
    DW_AT_type         DW_FORM_ref4
    DW_AT value: 0     DW_FORM value: 0
   52      DW_TAG_inlined_subroutine    [no children]
    DW_AT_abstract_origin DW_FORM_ref4
    DW_AT_low_pc       DW_FORM_addr
    DW_AT_high_pc      DW_FORM_data4
    DW_AT_call_file    DW_FORM_data1
    DW_AT_call_line    DW_FORM_data1
    DW_AT_call_column  DW_FORM_data1
    DW_AT value: 0     DW_FORM value: 0
   53      DW_TAG_formal_parameter    [no children]
    DW_AT_abstract_origin DW_FORM_ref4
    DW_AT value: 0     DW_FORM value: 0
   54      DW_TAG_inlined_subroutine    [no children]
    DW_AT_abstract_origin DW_FORM_ref4
    DW_AT_low_pc       DW_FORM_addr
    DW_AT_high_pc      DW_FORM_data4
    DW_AT_call_file    DW_FORM_data1
    DW_AT_call_line    DW_FORM_data2
    DW_AT_call_column  DW_FORM_data1
    DW_AT value: 0     DW_FORM value: 0
   55      DW_TAG_inlined_subroutine    [has children]
    DW_AT_abstract_origin DW_FORM_ref4
    DW_AT_low_pc       DW_FORM_addr
    DW_AT_high_pc      DW_FORM_data4
    DW_AT_call_file    DW_FORM_data1
    DW_AT_call_line    DW_FORM_data2
    DW_AT_call_column  DW_FORM_data1
    DW_AT value: 0     DW_FORM value: 0
   56      DW_TAG_inlined_subroutine    [has children]
    DW_AT_abstract_origin DW_FORM_ref4
    DW_AT_low_pc       DW_FORM_addr
    DW_AT_high_pc      DW_FORM_data4
    DW_AT_call_file    DW_FORM_data1
    DW_AT_call_line    DW_FORM_data2
    DW_AT_call_column  DW_FORM_data1
    DW_AT_GNU_discriminator DW_FORM_data1
    DW_AT value: 0     DW_FORM value: 0
   57      DW_TAG_inlined_subroutine    [has children]
    DW_AT_abstract_origin DW_FORM_ref4
    DW_AT_low_pc       DW_FORM_addr
    DW_AT_high_pc      DW_FORM_data4
    DW_AT_call_file    DW_FORM_data1
    DW_AT_call_line    DW_FORM_data1
    DW_AT_call_column  DW_FORM_data1
    DW_AT_GNU_discriminator DW_FORM_data1
    DW_AT value: 0     DW_FORM value: 0
   58      DW_TAG_variable    [no children]
    DW_AT_location     DW_FORM_exprloc
    DW_AT_abstract_origin DW_FORM_ref4
    DW_AT value: 0     DW_FORM value: 0
   59      DW_TAG_inlined_subroutine    [has children]
    DW_AT_abstract_origin DW_FORM_ref4
    DW_AT_ranges       DW_FORM_sec_offset
    DW_AT_call_file    DW_FORM_data1
    DW_AT_call_line    DW_FORM_data2
    DW_AT_call_column  DW_FORM_data1
    DW_AT value: 0     DW_FORM value: 0
   60      DW_TAG_inlined_subroutine    [no children]
    DW_AT_abstract_origin DW_FORM_ref4
    DW_AT_ranges       DW_FORM_sec_offset
    DW_AT_call_file    DW_FORM_data1
    DW_AT_call_line    DW_FORM_data1
    DW_AT_call_column  DW_FORM_data1
    DW_AT value: 0     DW_FORM value: 0

Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x29f8 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0xea4): zig 0.6.0
    <10>   DW_AT_language    : 12	(ANSI C99)
    <12>   DW_AT_name        : (indirect string, offset: 0x174e): main
    <16>   DW_AT_stmt_list   : 0x0
    <1a>   DW_AT_comp_dir    : (indirect string, offset: 0x391): /home/woody/sources/zig/embedded/Stm32BluePill
    <1e>   DW_AT_GNU_pubnames: 1
    <1e>   DW_AT_low_pc      : 0x0
    <22>   DW_AT_ranges      : 0x310
 <1><26>: Abbrev Number: 2 (DW_TAG_variable)
    <27>   DW_AT_name        : (indirect string, offset: 0x1e50): output_mode
    <2b>   DW_AT_type        : <0x35>
    <2f>   DW_AT_decl_file   : 2
    <30>   DW_AT_decl_line   : 4
    <31>   DW_AT_linkage_name: (indirect string, offset: 0x1e50): output_mode
 <1><35>: Abbrev Number: 3 (DW_TAG_enumeration_type)
    <36>   DW_AT_type        : <0x56>
    <3a>   DW_AT_name        : (indirect string, offset: 0x712): std.builtin.OutputMode
    <3e>   DW_AT_byte_size   : 0
    <3f>   DW_AT_decl_file   : 1
    <40>   DW_AT_decl_line   : 402
    <42>   DW_AT_alignment   : 1
 <2><43>: Abbrev Number: 4 (DW_TAG_enumerator)
    <44>   DW_AT_name        : (indirect string, offset: 0xc58): Exe
    <48>   DW_AT_const_value : 0
 <2><49>: Abbrev Number: 4 (DW_TAG_enumerator)
    <4a>   DW_AT_name        : (indirect string, offset: 0x114b): Lib
    <4e>   DW_AT_const_value : 1
 <2><4f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <50>   DW_AT_name        : (indirect string, offset: 0x15a): Obj
    <54>   DW_AT_const_value : 2
 <2><55>: Abbrev Number: 0
 <1><56>: Abbrev Number: 5 (DW_TAG_base_type)
    <57>   DW_AT_name        : (indirect string, offset: 0x157): u2
    <5b>   DW_AT_encoding    : 7	(unsigned)
    <5c>   DW_AT_byte_size   : 1
 <1><5d>: Abbrev Number: 2 (DW_TAG_variable)
    <5e>   DW_AT_name        : (indirect string, offset: 0x15e): link_libc
    <62>   DW_AT_type        : <0x6c>
    <66>   DW_AT_decl_file   : 2
    <67>   DW_AT_decl_line   : 45
    <68>   DW_AT_linkage_name: (indirect string, offset: 0x15e): link_libc
 <1><6c>: Abbrev Number: 5 (DW_TAG_base_type)
    <6d>   DW_AT_name        : (indirect string, offset: 0x1351): bool
    <71>   DW_AT_encoding    : 2	(boolean)
    <72>   DW_AT_byte_size   : 1
 <1><73>: Abbrev Number: 2 (DW_TAG_variable)
    <74>   DW_AT_name        : (indirect string, offset: 0x15a7): os
    <78>   DW_AT_type        : <0x82>
    <7c>   DW_AT_decl_file   : 2
    <7d>   DW_AT_decl_line   : 39
    <7e>   DW_AT_linkage_name: (indirect string, offset: 0x15a7): os
 <1><82>: Abbrev Number: 6 (DW_TAG_structure_type)
    <83>   DW_AT_name        : (indirect string, offset: 0x28): std.target.Os
    <87>   DW_AT_byte_size   : 40
    <88>   DW_AT_decl_file   : 3
    <89>   DW_AT_decl_line   : 14
    <8a>   DW_AT_alignment   : 4
 <2><8b>: Abbrev Number: 7 (DW_TAG_member)
    <8c>   DW_AT_name        : (indirect string, offset: 0x3c0): tag
    <90>   DW_AT_type        : <0xb6>
    <94>   DW_AT_decl_file   : 3
    <95>   DW_AT_decl_line   : 15
    <96>   DW_AT_byte_size   : 0
    <97>   DW_AT_bit_size    : 8
    <98>   DW_AT_bit_offset  : 0xfffffffffffffffa
    <a0>   DW_AT_data_member_location: 0x1fffffffffffffff
 <2><a8>: Abbrev Number: 8 (DW_TAG_member)
    <a9>   DW_AT_name        : (indirect string, offset: 0x1cee): version_range
    <ad>   DW_AT_type        : <0x1a9>
    <b1>   DW_AT_decl_file   : 3
    <b2>   DW_AT_decl_line   : 16
    <b3>   DW_AT_alignment   : 4
    <b4>   DW_AT_data_member_location: 4
 <2><b5>: Abbrev Number: 0
 <1><b6>: Abbrev Number: 9 (DW_TAG_enumeration_type)
    <b7>   DW_AT_type        : <0x1a2>
    <bb>   DW_AT_name        : (indirect string, offset: 0x1bbd): std.target.Tag
    <bf>   DW_AT_byte_size   : 0
    <c0>   DW_AT_decl_file   : 3
    <c1>   DW_AT_decl_line   : 18
    <c2>   DW_AT_alignment   : 1
 <2><c3>: Abbrev Number: 4 (DW_TAG_enumerator)
    <c4>   DW_AT_name        : (indirect string, offset: 0x5e7): freestanding
    <c8>   DW_AT_const_value : 0
 <2><c9>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ca>   DW_AT_name        : (indirect string, offset: 0x114f): ananas
    <ce>   DW_AT_const_value : 1
 <2><cf>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d0>   DW_AT_name        : (indirect string, offset: 0xf76): cloudabi
    <d4>   DW_AT_const_value : 2
 <2><d5>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d6>   DW_AT_name        : (indirect string, offset: 0x1d7a): dragonfly
    <da>   DW_AT_const_value : 3
 <2><db>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dc>   DW_AT_name        : (indirect string, offset: 0x19c9): freebsd
    <e0>   DW_AT_const_value : 4
 <2><e1>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e2>   DW_AT_name        : (indirect string, offset: 0x19d1): fuchsia
    <e6>   DW_AT_const_value : 5
 <2><e7>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e8>   DW_AT_name        : (indirect string, offset: 0xe0b): ios
    <ec>   DW_AT_const_value : 6
 <2><ed>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ee>   DW_AT_name        : (indirect string, offset: 0x983): kfreebsd
    <f2>   DW_AT_const_value : 7
 <2><f3>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f4>   DW_AT_name        : (indirect string, offset: 0x1753): linux
    <f8>   DW_AT_const_value : 8
 <2><f9>: Abbrev Number: 4 (DW_TAG_enumerator)
    <fa>   DW_AT_name        : (indirect string, offset: 0x15aa): lv2
    <fe>   DW_AT_const_value : 9
 <2><ff>: Abbrev Number: 4 (DW_TAG_enumerator)
    <100>   DW_AT_name        : (indirect string, offset: 0x0): macosx
    <104>   DW_AT_const_value : 10
 <2><105>: Abbrev Number: 4 (DW_TAG_enumerator)
    <106>   DW_AT_name        : (indirect string, offset: 0x266): netbsd
    <10a>   DW_AT_const_value : 11
 <2><10b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <10c>   DW_AT_name        : (indirect string, offset: 0xe0f): openbsd
    <110>   DW_AT_const_value : 12
 <2><111>: Abbrev Number: 4 (DW_TAG_enumerator)
    <112>   DW_AT_name        : (indirect string, offset: 0x1759): solaris
    <116>   DW_AT_const_value : 13
 <2><117>: Abbrev Number: 4 (DW_TAG_enumerator)
    <118>   DW_AT_name        : (indirect string, offset: 0x1d84): windows
    <11c>   DW_AT_const_value : 14
 <2><11d>: Abbrev Number: 4 (DW_TAG_enumerator)
    <11e>   DW_AT_name        : (indirect string, offset: 0xa08): haiku
    <122>   DW_AT_const_value : 15
 <2><123>: Abbrev Number: 4 (DW_TAG_enumerator)
    <124>   DW_AT_name        : (indirect string, offset: 0x1ce2): minix
    <128>   DW_AT_const_value : 16
 <2><129>: Abbrev Number: 4 (DW_TAG_enumerator)
    <12a>   DW_AT_name        : (indirect string, offset: 0x1ce8): rtems
    <12e>   DW_AT_const_value : 17
 <2><12f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <130>   DW_AT_name        : (indirect string, offset: 0x15ae): nacl
    <134>   DW_AT_const_value : 18
 <2><135>: Abbrev Number: 4 (DW_TAG_enumerator)
    <136>   DW_AT_name        : (indirect string, offset: 0xf7f): cnk
    <13a>   DW_AT_const_value : 19
 <2><13b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <13c>   DW_AT_name        : (indirect string, offset: 0x50a): aix
    <140>   DW_AT_const_value : 20
 <2><141>: Abbrev Number: 4 (DW_TAG_enumerator)
    <142>   DW_AT_name        : (indirect string, offset: 0x7): cuda
    <146>   DW_AT_const_value : 21
 <2><147>: Abbrev Number: 4 (DW_TAG_enumerator)
    <148>   DW_AT_name        : (indirect string, offset: 0x15b3): nvcl
    <14c>   DW_AT_const_value : 22
 <2><14d>: Abbrev Number: 4 (DW_TAG_enumerator)
    <14e>   DW_AT_name        : (indirect string, offset: 0x105d): amdhsa
    <152>   DW_AT_const_value : 23
 <2><153>: Abbrev Number: 4 (DW_TAG_enumerator)
    <154>   DW_AT_name        : (indirect string, offset: 0x3c4): ps4
    <158>   DW_AT_const_value : 24
 <2><159>: Abbrev Number: 4 (DW_TAG_enumerator)
    <15a>   DW_AT_name        : (indirect string, offset: 0x729): elfiamcu
    <15e>   DW_AT_const_value : 25
 <2><15f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <160>   DW_AT_name        : (indirect string, offset: 0xc5c): tvos
    <164>   DW_AT_const_value : 26
 <2><165>: Abbrev Number: 4 (DW_TAG_enumerator)
    <166>   DW_AT_name        : (indirect string, offset: 0x5f4): watchos
    <16a>   DW_AT_const_value : 27
 <2><16b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <16c>   DW_AT_name        : (indirect string, offset: 0xb71): mesa3d
    <170>   DW_AT_const_value : 28
 <2><171>: Abbrev Number: 4 (DW_TAG_enumerator)
    <172>   DW_AT_name        : (indirect string, offset: 0xa0e): contiki
    <176>   DW_AT_const_value : 29
 <2><177>: Abbrev Number: 4 (DW_TAG_enumerator)
    <178>   DW_AT_name        : (indirect string, offset: 0x1a85): amdpal
    <17c>   DW_AT_const_value : 30
 <2><17d>: Abbrev Number: 4 (DW_TAG_enumerator)
    <17e>   DW_AT_name        : (indirect string, offset: 0x1156): hermit
    <182>   DW_AT_const_value : 31
 <2><183>: Abbrev Number: 4 (DW_TAG_enumerator)
    <184>   DW_AT_name        : (indirect string, offset: 0x185b): hurd
    <188>   DW_AT_const_value : 32
 <2><189>: Abbrev Number: 4 (DW_TAG_enumerator)
    <18a>   DW_AT_name        : (indirect string, offset: 0x1761): wasi
    <18e>   DW_AT_const_value : 33
 <2><18f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <190>   DW_AT_name        : (indirect string, offset: 0x1d8c): emscripten
    <194>   DW_AT_const_value : 34
 <2><195>: Abbrev Number: 4 (DW_TAG_enumerator)
    <196>   DW_AT_name        : (indirect string, offset: 0x1f1a): uefi
    <19a>   DW_AT_const_value : 35
 <2><19b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <19c>   DW_AT_name        : (indirect string, offset: 0x5fc): other
    <1a0>   DW_AT_const_value : 36
 <2><1a1>: Abbrev Number: 0
 <1><1a2>: Abbrev Number: 5 (DW_TAG_base_type)
    <1a3>   DW_AT_name        : (indirect string, offset: 0x1bba): u6
    <1a7>   DW_AT_encoding    : 7	(unsigned)
    <1a8>   DW_AT_byte_size   : 1
 <1><1a9>: Abbrev Number: 10 (DW_TAG_union_type)
    <1aa>   DW_AT_name        : (indirect string, offset: 0xa1c): std.target.VersionRange
    <1ae>   DW_AT_byte_size   : 36
    <1af>   DW_AT_decl_file   : 3
    <1b0>   DW_AT_decl_line   : 161
    <1b1>   DW_AT_alignment   : 4
 <2><1b2>: Abbrev Number: 8 (DW_TAG_member)
    <1b3>   DW_AT_name        : (indirect string, offset: 0x1a8c): semver
    <1b7>   DW_AT_type        : <0x1da>
    <1bb>   DW_AT_decl_file   : 3
    <1bc>   DW_AT_decl_line   : 163
    <1bd>   DW_AT_alignment   : 4
    <1be>   DW_AT_data_member_location: 0
 <2><1bf>: Abbrev Number: 8 (DW_TAG_member)
    <1c0>   DW_AT_name        : (indirect string, offset: 0x1753): linux
    <1c4>   DW_AT_type        : <0x23d>
    <1c8>   DW_AT_decl_file   : 3
    <1c9>   DW_AT_decl_line   : 164
    <1ca>   DW_AT_alignment   : 4
    <1cb>   DW_AT_data_member_location: 0
 <2><1cc>: Abbrev Number: 8 (DW_TAG_member)
    <1cd>   DW_AT_name        : (indirect string, offset: 0x1d84): windows
    <1d1>   DW_AT_type        : <0x261>
    <1d5>   DW_AT_decl_file   : 3
    <1d6>   DW_AT_decl_line   : 165
    <1d7>   DW_AT_alignment   : 4
    <1d8>   DW_AT_data_member_location: 0
 <2><1d9>: Abbrev Number: 0
 <1><1da>: Abbrev Number: 11 (DW_TAG_structure_type)
    <1db>   DW_AT_name        : (indirect string, offset: 0x1940): std.builtin.Range
    <1df>   DW_AT_byte_size   : 24
    <1e0>   DW_AT_decl_file   : 1
    <1e1>   DW_AT_decl_line   : 422
    <1e3>   DW_AT_alignment   : 4
 <2><1e4>: Abbrev Number: 12 (DW_TAG_member)
    <1e5>   DW_AT_name        : (indirect string, offset: 0x1064): min
    <1e9>   DW_AT_type        : <0x201>
    <1ed>   DW_AT_decl_file   : 1
    <1ee>   DW_AT_decl_line   : 423
    <1f0>   DW_AT_alignment   : 4
    <1f1>   DW_AT_data_member_location: 0
 <2><1f2>: Abbrev Number: 12 (DW_TAG_member)
    <1f3>   DW_AT_name        : (indirect string, offset: 0xc6): max
    <1f7>   DW_AT_type        : <0x201>
    <1fb>   DW_AT_decl_file   : 1
    <1fc>   DW_AT_decl_line   : 424
    <1fe>   DW_AT_alignment   : 4
    <1ff>   DW_AT_data_member_location: 12
 <2><200>: Abbrev Number: 0
 <1><201>: Abbrev Number: 11 (DW_TAG_structure_type)
    <202>   DW_AT_name        : (indirect string, offset: 0x1e5c): std.builtin.Version
    <206>   DW_AT_byte_size   : 12
    <207>   DW_AT_decl_file   : 1
    <208>   DW_AT_decl_line   : 417
    <20a>   DW_AT_alignment   : 4
 <2><20b>: Abbrev Number: 12 (DW_TAG_member)
    <20c>   DW_AT_name        : (indirect string, offset: 0x193a): major
    <210>   DW_AT_type        : <0x236>
    <214>   DW_AT_decl_file   : 1
    <215>   DW_AT_decl_line   : 418
    <217>   DW_AT_alignment   : 4
    <218>   DW_AT_data_member_location: 0
 <2><219>: Abbrev Number: 12 (DW_TAG_member)
    <21a>   DW_AT_name        : (indirect string, offset: 0x1cfc): minor
    <21e>   DW_AT_type        : <0x236>
    <222>   DW_AT_decl_file   : 1
    <223>   DW_AT_decl_line   : 419
    <225>   DW_AT_alignment   : 4
    <226>   DW_AT_data_member_location: 4
 <2><227>: Abbrev Number: 12 (DW_TAG_member)
    <228>   DW_AT_name        : (indirect string, offset: 0x26d): patch
    <22c>   DW_AT_type        : <0x236>
    <230>   DW_AT_decl_file   : 1
    <231>   DW_AT_decl_line   : 420
    <233>   DW_AT_alignment   : 4
    <234>   DW_AT_data_member_location: 8
 <2><235>: Abbrev Number: 0
 <1><236>: Abbrev Number: 5 (DW_TAG_base_type)
    <237>   DW_AT_name        : (indirect string, offset: 0xc): u32
    <23b>   DW_AT_encoding    : 7	(unsigned)
    <23c>   DW_AT_byte_size   : 4
 <1><23d>: Abbrev Number: 6 (DW_TAG_structure_type)
    <23e>   DW_AT_name        : (indirect string, offset: 0x106e): std.target.LinuxVersionRange
    <242>   DW_AT_byte_size   : 36
    <243>   DW_AT_decl_file   : 3
    <244>   DW_AT_decl_line   : 131
    <245>   DW_AT_alignment   : 4
 <2><246>: Abbrev Number: 8 (DW_TAG_member)
    <247>   DW_AT_name        : (indirect string, offset: 0x50e): range
    <24b>   DW_AT_type        : <0x1da>
    <24f>   DW_AT_decl_file   : 3
    <250>   DW_AT_decl_line   : 132
    <251>   DW_AT_alignment   : 4
    <252>   DW_AT_data_member_location: 0
 <2><253>: Abbrev Number: 8 (DW_TAG_member)
    <254>   DW_AT_name        : (indirect string, offset: 0x1068): glibc
    <258>   DW_AT_type        : <0x201>
    <25c>   DW_AT_decl_file   : 3
    <25d>   DW_AT_decl_line   : 133
    <25e>   DW_AT_alignment   : 4
    <25f>   DW_AT_data_member_location: 24
 <2><260>: Abbrev Number: 0
 <1><261>: Abbrev Number: 6 (DW_TAG_structure_type)
    <262>   DW_AT_name        : (indirect string, offset: 0x1e70): std.target.Range
    <266>   DW_AT_byte_size   : 8
    <267>   DW_AT_decl_file   : 3
    <268>   DW_AT_decl_line   : 96
    <269>   DW_AT_alignment   : 4
 <2><26a>: Abbrev Number: 8 (DW_TAG_member)
    <26b>   DW_AT_name        : (indirect string, offset: 0x1064): min
    <26f>   DW_AT_type        : <0x285>
    <273>   DW_AT_decl_file   : 3
    <274>   DW_AT_decl_line   : 97
    <275>   DW_AT_alignment   : 4
    <276>   DW_AT_data_member_location: 0
 <2><277>: Abbrev Number: 8 (DW_TAG_member)
    <278>   DW_AT_name        : (indirect string, offset: 0xc6): max
    <27c>   DW_AT_type        : <0x285>
    <280>   DW_AT_decl_file   : 3
    <281>   DW_AT_decl_line   : 98
    <282>   DW_AT_alignment   : 4
    <283>   DW_AT_data_member_location: 4
 <2><284>: Abbrev Number: 0
 <1><285>: Abbrev Number: 9 (DW_TAG_enumeration_type)
    <286>   DW_AT_type        : <0x236>
    <28a>   DW_AT_name        : (indirect string, offset: 0x997): std.target.WindowsVersion
    <28e>   DW_AT_byte_size   : 4
    <28f>   DW_AT_decl_file   : 3
    <290>   DW_AT_decl_line   : 77
    <291>   DW_AT_alignment   : 4
 <2><292>: Abbrev Number: 4 (DW_TAG_enumerator)
    <293>   DW_AT_name        : (indirect string, offset: 0x10): nt4
    <297>   DW_AT_const_value : 67108864
 <2><29b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <29c>   DW_AT_name        : (indirect string, offset: 0xa16): win2k
    <2a0>   DW_AT_const_value : 83886080
 <2><2a4>: Abbrev Number: 4 (DW_TAG_enumerator)
    <2a5>   DW_AT_name        : (indirect string, offset: 0x168): xp
    <2a9>   DW_AT_const_value : 83951616
 <2><2ad>: Abbrev Number: 4 (DW_TAG_enumerator)
    <2ae>   DW_AT_name        : (indirect string, offset: 0xc61): ws2003
    <2b2>   DW_AT_const_value : 84017152
 <2><2b6>: Abbrev Number: 4 (DW_TAG_enumerator)
    <2b7>   DW_AT_name        : (indirect string, offset: 0x19d9): vista
    <2bb>   DW_AT_const_value : 100663296
 <2><2bf>: Abbrev Number: 4 (DW_TAG_enumerator)
    <2c0>   DW_AT_name        : (indirect string, offset: 0x19df): win7
    <2c4>   DW_AT_const_value : 100728832
 <2><2c8>: Abbrev Number: 4 (DW_TAG_enumerator)
    <2c9>   DW_AT_name        : (indirect string, offset: 0xca): win8
    <2cd>   DW_AT_const_value : 100794368
 <2><2d1>: Abbrev Number: 4 (DW_TAG_enumerator)
    <2d2>   DW_AT_name        : (indirect string, offset: 0x1d97): win8_1
    <2d6>   DW_AT_const_value : 100859904
 <2><2da>: Abbrev Number: 4 (DW_TAG_enumerator)
    <2db>   DW_AT_name        : (indirect string, offset: 0x1766): win10
    <2df>   DW_AT_const_value : 167772160
 <2><2e3>: Abbrev Number: 4 (DW_TAG_enumerator)
    <2e4>   DW_AT_name        : (indirect string, offset: 0x176c): win10_th2
    <2e8>   DW_AT_const_value : 167772161
 <2><2ec>: Abbrev Number: 4 (DW_TAG_enumerator)
    <2ed>   DW_AT_name        : (indirect string, offset: 0x14): win10_rs1
    <2f1>   DW_AT_const_value : 167772162
 <2><2f5>: Abbrev Number: 4 (DW_TAG_enumerator)
    <2f6>   DW_AT_name        : (indirect string, offset: 0xf83): win10_rs2
    <2fa>   DW_AT_const_value : 167772163
 <2><2fe>: Abbrev Number: 4 (DW_TAG_enumerator)
    <2ff>   DW_AT_name        : (indirect string, offset: 0x1e): win10_rs3
    <303>   DW_AT_const_value : 167772164
 <2><307>: Abbrev Number: 4 (DW_TAG_enumerator)
    <308>   DW_AT_name        : (indirect string, offset: 0x602): win10_rs4
    <30c>   DW_AT_const_value : 167772165
 <2><310>: Abbrev Number: 4 (DW_TAG_enumerator)
    <311>   DW_AT_name        : (indirect string, offset: 0x732): win10_rs5
    <315>   DW_AT_const_value : 167772166
 <2><319>: Abbrev Number: 4 (DW_TAG_enumerator)
    <31a>   DW_AT_name        : (indirect string, offset: 0x98c): win10_19h1
    <31e>   DW_AT_const_value : 167772167
 <2><322>: Abbrev Number: 0
 <1><323>: Abbrev Number: 2 (DW_TAG_variable)
    <324>   DW_AT_name        : (indirect string, offset: 0x60c): arch
    <328>   DW_AT_type        : <0x332>
    <32c>   DW_AT_decl_file   : 2
    <32d>   DW_AT_decl_line   : 9
    <32e>   DW_AT_linkage_name: (indirect string, offset: 0x60c): arch
 <1><332>: Abbrev Number: 3 (DW_TAG_enumeration_type)
    <333>   DW_AT_type        : <0x1a2>
    <337>   DW_AT_name        : (indirect string, offset: 0xf93): std.target.Arch
    <33b>   DW_AT_byte_size   : 0
    <33c>   DW_AT_decl_file   : 3
    <33d>   DW_AT_decl_line   : 581
    <33f>   DW_AT_alignment   : 1
 <2><340>: Abbrev Number: 4 (DW_TAG_enumerator)
    <341>   DW_AT_name        : (indirect string, offset: 0x36): arm
    <345>   DW_AT_const_value : 0
 <2><346>: Abbrev Number: 4 (DW_TAG_enumerator)
    <347>   DW_AT_name        : (indirect string, offset: 0x1f1f): armeb
    <34b>   DW_AT_const_value : 1
 <2><34c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <34d>   DW_AT_name        : (indirect string, offset: 0x1776): aarch64
    <351>   DW_AT_const_value : 2
 <2><352>: Abbrev Number: 4 (DW_TAG_enumerator)
    <353>   DW_AT_name        : (indirect string, offset: 0x3c8): aarch64_be
    <357>   DW_AT_const_value : 3
 <2><358>: Abbrev Number: 4 (DW_TAG_enumerator)
    <359>   DW_AT_name        : (indirect string, offset: 0x3d3): aarch64_32
    <35d>   DW_AT_const_value : 4
 <2><35e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <35f>   DW_AT_name        : (indirect string, offset: 0xa34): arc
    <363>   DW_AT_const_value : 5
 <2><364>: Abbrev Number: 4 (DW_TAG_enumerator)
    <365>   DW_AT_name        : (indirect string, offset: 0x1356): avr
    <369>   DW_AT_const_value : 6
 <2><36a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <36b>   DW_AT_name        : (indirect string, offset: 0x16b): bpfel
    <36f>   DW_AT_const_value : 7
 <2><370>: Abbrev Number: 4 (DW_TAG_enumerator)
    <371>   DW_AT_name        : (indirect string, offset: 0x1952): bpfeb
    <375>   DW_AT_const_value : 8
 <2><376>: Abbrev Number: 4 (DW_TAG_enumerator)
    <377>   DW_AT_name        : (indirect string, offset: 0x3a): hexagon
    <37b>   DW_AT_const_value : 9
 <2><37c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <37d>   DW_AT_name        : (indirect string, offset: 0xe17): mips
    <381>   DW_AT_const_value : 10
 <2><382>: Abbrev Number: 4 (DW_TAG_enumerator)
    <383>   DW_AT_name        : (indirect string, offset: 0x73c): mipsel
    <387>   DW_AT_const_value : 11
 <2><388>: Abbrev Number: 4 (DW_TAG_enumerator)
    <389>   DW_AT_name        : (indirect string, offset: 0x611): mips64
    <38d>   DW_AT_const_value : 12
 <2><38e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <38f>   DW_AT_name        : (indirect string, offset: 0x1d02): mips64el
    <393>   DW_AT_const_value : 13
 <2><394>: Abbrev Number: 4 (DW_TAG_enumerator)
    <395>   DW_AT_name        : (indirect string, offset: 0x135a): msp430
    <399>   DW_AT_const_value : 14
 <2><39a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <39b>   DW_AT_name        : (indirect string, offset: 0x1500): powerpc
    <39f>   DW_AT_const_value : 15
 <2><3a0>: Abbrev Number: 4 (DW_TAG_enumerator)
    <3a1>   DW_AT_name        : (indirect string, offset: 0x1f25): powerpc64
    <3a5>   DW_AT_const_value : 16
 <2><3a6>: Abbrev Number: 4 (DW_TAG_enumerator)
    <3a7>   DW_AT_name        : (indirect string, offset: 0x273): powerpc64le
    <3ab>   DW_AT_const_value : 17
 <2><3ac>: Abbrev Number: 4 (DW_TAG_enumerator)
    <3ad>   DW_AT_name        : (indirect string, offset: 0x9b1): r600
    <3b1>   DW_AT_const_value : 18
 <2><3b2>: Abbrev Number: 4 (DW_TAG_enumerator)
    <3b3>   DW_AT_name        : (indirect string, offset: 0x1b2c): amdgcn
    <3b7>   DW_AT_const_value : 19
 <2><3b8>: Abbrev Number: 4 (DW_TAG_enumerator)
    <3b9>   DW_AT_name        : (indirect string, offset: 0xb78): riscv32
    <3bd>   DW_AT_const_value : 20
 <2><3be>: Abbrev Number: 4 (DW_TAG_enumerator)
    <3bf>   DW_AT_name        : (indirect string, offset: 0x27f): riscv64
    <3c3>   DW_AT_const_value : 21
 <2><3c4>: Abbrev Number: 4 (DW_TAG_enumerator)
    <3c5>   DW_AT_name        : (indirect string, offset: 0x1361): sparc
    <3c9>   DW_AT_const_value : 22
 <2><3ca>: Abbrev Number: 4 (DW_TAG_enumerator)
    <3cb>   DW_AT_name        : (indirect string, offset: 0x1a93): sparcv9
    <3cf>   DW_AT_const_value : 23
 <2><3d0>: Abbrev Number: 4 (DW_TAG_enumerator)
    <3d1>   DW_AT_name        : (indirect string, offset: 0x514): sparcel
    <3d5>   DW_AT_const_value : 24
 <2><3d6>: Abbrev Number: 4 (DW_TAG_enumerator)
    <3d7>   DW_AT_name        : (indirect string, offset: 0x618): s390x
    <3db>   DW_AT_const_value : 25
 <2><3dc>: Abbrev Number: 4 (DW_TAG_enumerator)
    <3dd>   DW_AT_name        : (indirect string, offset: 0x51c): tce
    <3e1>   DW_AT_const_value : 26
 <2><3e2>: Abbrev Number: 4 (DW_TAG_enumerator)
    <3e3>   DW_AT_name        : (indirect string, offset: 0xb80): tcele
    <3e7>   DW_AT_const_value : 27
 <2><3e8>: Abbrev Number: 4 (DW_TAG_enumerator)
    <3e9>   DW_AT_name        : (indirect string, offset: 0x1367): thumb
    <3ed>   DW_AT_const_value : 28
 <2><3ee>: Abbrev Number: 4 (DW_TAG_enumerator)
    <3ef>   DW_AT_name        : (indirect string, offset: 0x177e): thumbeb
    <3f3>   DW_AT_const_value : 29
 <2><3f4>: Abbrev Number: 4 (DW_TAG_enumerator)
    <3f5>   DW_AT_name        : (indirect string, offset: 0x1786): i386
    <3f9>   DW_AT_const_value : 30
 <2><3fa>: Abbrev Number: 4 (DW_TAG_enumerator)
    <3fb>   DW_AT_name        : (indirect string, offset: 0xcf): x86_64
    <3ff>   DW_AT_const_value : 31
 <2><400>: Abbrev Number: 4 (DW_TAG_enumerator)
    <401>   DW_AT_name        : (indirect string, offset: 0xf8d): xcore
    <405>   DW_AT_const_value : 32
 <2><406>: Abbrev Number: 4 (DW_TAG_enumerator)
    <407>   DW_AT_name        : (indirect string, offset: 0x8fd): nvptx
    <40b>   DW_AT_const_value : 33
 <2><40c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <40d>   DW_AT_name        : (indirect string, offset: 0x115d): nvptx64
    <411>   DW_AT_const_value : 34
 <2><412>: Abbrev Number: 4 (DW_TAG_enumerator)
    <413>   DW_AT_name        : (indirect string, offset: 0x1508): le32
    <417>   DW_AT_const_value : 35
 <2><418>: Abbrev Number: 4 (DW_TAG_enumerator)
    <419>   DW_AT_name        : (indirect string, offset: 0x1d9e): le64
    <41d>   DW_AT_const_value : 36
 <2><41e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <41f>   DW_AT_name        : (indirect string, offset: 0x1958): amdil
    <423>   DW_AT_const_value : 37
 <2><424>: Abbrev Number: 4 (DW_TAG_enumerator)
    <425>   DW_AT_name        : (indirect string, offset: 0x178b): amdil64
    <429>   DW_AT_const_value : 38
 <2><42a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <42b>   DW_AT_name        : (indirect string, offset: 0xa38): hsail
    <42f>   DW_AT_const_value : 39
 <2><430>: Abbrev Number: 4 (DW_TAG_enumerator)
    <431>   DW_AT_name        : (indirect string, offset: 0x1da3): hsail64
    <435>   DW_AT_const_value : 40
 <2><436>: Abbrev Number: 4 (DW_TAG_enumerator)
    <437>   DW_AT_name        : (indirect string, offset: 0x1d0b): spir
    <43b>   DW_AT_const_value : 41
 <2><43c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <43d>   DW_AT_name        : (indirect string, offset: 0x1a9b): spir64
    <441>   DW_AT_const_value : 42
 <2><442>: Abbrev Number: 4 (DW_TAG_enumerator)
    <443>   DW_AT_name        : (indirect string, offset: 0x15b8): kalimba
    <447>   DW_AT_const_value : 43
 <2><448>: Abbrev Number: 4 (DW_TAG_enumerator)
    <449>   DW_AT_name        : (indirect string, offset: 0x3de): shave
    <44d>   DW_AT_const_value : 44
 <2><44e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <44f>   DW_AT_name        : (indirect string, offset: 0x743): lanai
    <453>   DW_AT_const_value : 45
 <2><454>: Abbrev Number: 4 (DW_TAG_enumerator)
    <455>   DW_AT_name        : (indirect string, offset: 0x3e4): wasm32
    <459>   DW_AT_const_value : 46
 <2><45a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <45b>   DW_AT_name        : (indirect string, offset: 0xc68): wasm64
    <45f>   DW_AT_const_value : 47
 <2><460>: Abbrev Number: 4 (DW_TAG_enumerator)
    <461>   DW_AT_name        : (indirect string, offset: 0x520): renderscript32
    <465>   DW_AT_const_value : 48
 <2><466>: Abbrev Number: 4 (DW_TAG_enumerator)
    <467>   DW_AT_name        : (indirect string, offset: 0xb86): renderscript64
    <46b>   DW_AT_const_value : 49
 <2><46c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <46d>   DW_AT_name        : (indirect string, offset: 0x42): ve
    <471>   DW_AT_const_value : 50
 <2><472>: Abbrev Number: 0
 <1><473>: Abbrev Number: 11 (DW_TAG_structure_type)
    <474>   DW_AT_name        : (indirect string, offset: 0x15c0): std.target.Set
    <478>   DW_AT_byte_size   : 20
    <479>   DW_AT_decl_file   : 3
    <47a>   DW_AT_decl_line   : 485
    <47c>   DW_AT_alignment   : 4
 <2><47d>: Abbrev Number: 12 (DW_TAG_member)
    <47e>   DW_AT_name        : (indirect string, offset: 0x108b): ints
    <482>   DW_AT_type        : <0x4bc>
    <486>   DW_AT_decl_file   : 3
    <487>   DW_AT_decl_line   : 486
    <489>   DW_AT_alignment   : 4
    <48a>   DW_AT_data_member_location: 0
 <2><48b>: Abbrev Number: 13 (DW_TAG_variable)
    <48c>   DW_AT_name        : (indirect string, offset: 0x52f): needed_bit_count
    <490>   DW_AT_type        : <0x4d6>
    <494>   DW_AT_decl_file   : 3
    <495>   DW_AT_decl_line   : 488
    <497>   DW_AT_linkage_name: (indirect string, offset: 0x52f): needed_bit_count
 <2><49b>: Abbrev Number: 13 (DW_TAG_variable)
    <49c>   DW_AT_name        : (indirect string, offset: 0xfa9): byte_count
    <4a0>   DW_AT_type        : <0x4d6>
    <4a4>   DW_AT_decl_file   : 3
    <4a5>   DW_AT_decl_line   : 489
    <4a7>   DW_AT_linkage_name: (indirect string, offset: 0xfa9): byte_count
 <2><4ab>: Abbrev Number: 13 (DW_TAG_variable)
    <4ac>   DW_AT_name        : (indirect string, offset: 0xb95): usize_count
    <4b0>   DW_AT_type        : <0x4d6>
    <4b4>   DW_AT_decl_file   : 3
    <4b5>   DW_AT_decl_line   : 490
    <4b7>   DW_AT_linkage_name: (indirect string, offset: 0xb95): usize_count
 <2><4bb>: Abbrev Number: 0
 <1><4bc>: Abbrev Number: 14 (DW_TAG_array_type)
    <4bd>   DW_AT_type        : <0x4c8>
 <2><4c1>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <4c2>   DW_AT_type        : <0x4cf>
    <4c6>   DW_AT_count       : 5
 <2><4c7>: Abbrev Number: 0
 <1><4c8>: Abbrev Number: 5 (DW_TAG_base_type)
    <4c9>   DW_AT_name        : (indirect string, offset: 0xfa3): usize
    <4cd>   DW_AT_encoding    : 7	(unsigned)
    <4ce>   DW_AT_byte_size   : 4
 <1><4cf>: Abbrev Number: 16 (DW_TAG_base_type)
    <4d0>   DW_AT_name        : (indirect string, offset: 0x749): __ARRAY_SIZE_TYPE__
    <4d4>   DW_AT_byte_size   : 8
    <4d5>   DW_AT_encoding    : 7	(unsigned)
 <1><4d6>: Abbrev Number: 5 (DW_TAG_base_type)
    <4d7>   DW_AT_name        : (indirect string, offset: 0x1165): u8
    <4db>   DW_AT_encoding    : 8	(unsigned char)
    <4dc>   DW_AT_byte_size   : 1
 <1><4dd>: Abbrev Number: 13 (DW_TAG_variable)
    <4de>   DW_AT_name        : (indirect string, offset: 0x195e): PERIPH_BASE
    <4e2>   DW_AT_type        : <0x4ed>
    <4e6>   DW_AT_decl_file   : 4
    <4e7>   DW_AT_decl_line   : 305
    <4e9>   DW_AT_linkage_name: (indirect string, offset: 0x195e): PERIPH_BASE
 <1><4ed>: Abbrev Number: 5 (DW_TAG_base_type)
    <4ee>   DW_AT_name        : (indirect string, offset: 0x171): u31
    <4f2>   DW_AT_encoding    : 7	(unsigned)
    <4f3>   DW_AT_byte_size   : 4
 <1><4f4>: Abbrev Number: 13 (DW_TAG_variable)
    <4f5>   DW_AT_name        : (indirect string, offset: 0xeae): APB2PERIPH_BASE
    <4f9>   DW_AT_type        : <0x4ed>
    <4fd>   DW_AT_decl_file   : 4
    <4fe>   DW_AT_decl_line   : 306
    <500>   DW_AT_linkage_name: (indirect string, offset: 0xeae): APB2PERIPH_BASE
 <1><504>: Abbrev Number: 13 (DW_TAG_variable)
    <505>   DW_AT_name        : (indirect string, offset: 0xebe): USART1_BASE
    <509>   DW_AT_type        : <0x236>
    <50d>   DW_AT_decl_file   : 4
    <50e>   DW_AT_decl_line   : 428
    <510>   DW_AT_linkage_name: (indirect string, offset: 0xebe): USART1_BASE
 <1><514>: Abbrev Number: 13 (DW_TAG_variable)
    <515>   DW_AT_name        : (indirect string, offset: 0xfb4): USART1
    <519>   DW_AT_type        : <0x524>
    <51d>   DW_AT_decl_file   : 4
    <51e>   DW_AT_decl_line   : 429
    <520>   DW_AT_linkage_name: (indirect string, offset: 0xfb4): USART1
 <1><524>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <525>   DW_AT_type        : <0x52d>
    <529>   DW_AT_name        : (indirect string, offset: 0x1e81): *stm32f103.USART_t
 <1><52d>: Abbrev Number: 11 (DW_TAG_structure_type)
    <52e>   DW_AT_name        : (indirect string, offset: 0x287): stm32f103.USART_t
    <532>   DW_AT_byte_size   : 28
    <533>   DW_AT_decl_file   : 4
    <534>   DW_AT_decl_line   : 425
    <536>   DW_AT_alignment   : 1
 <2><537>: Abbrev Number: 12 (DW_TAG_member)
    <538>   DW_AT_name        : (indirect string, offset: 0xba1): SR
    <53c>   DW_AT_type        : <0x236>
    <540>   DW_AT_decl_file   : 4
    <541>   DW_AT_decl_line   : 426
    <543>   DW_AT_alignment   : 4
    <544>   DW_AT_data_member_location: 0
 <2><545>: Abbrev Number: 12 (DW_TAG_member)
    <546>   DW_AT_name        : (indirect string, offset: 0x1d10): DR
    <54a>   DW_AT_type        : <0x236>
    <54e>   DW_AT_decl_file   : 4
    <54f>   DW_AT_decl_line   : 426
    <551>   DW_AT_alignment   : 4
    <552>   DW_AT_data_member_location: 4
 <2><553>: Abbrev Number: 12 (DW_TAG_member)
    <554>   DW_AT_name        : (indirect string, offset: 0xd6): BRR
    <558>   DW_AT_type        : <0x236>
    <55c>   DW_AT_decl_file   : 4
    <55d>   DW_AT_decl_line   : 426
    <55f>   DW_AT_alignment   : 4
    <560>   DW_AT_data_member_location: 8
 <2><561>: Abbrev Number: 12 (DW_TAG_member)
    <562>   DW_AT_name        : (indirect string, offset: 0x136d): CR1
    <566>   DW_AT_type        : <0x236>
    <56a>   DW_AT_decl_file   : 4
    <56b>   DW_AT_decl_line   : 426
    <56d>   DW_AT_alignment   : 4
    <56e>   DW_AT_data_member_location: 12
 <2><56f>: Abbrev Number: 12 (DW_TAG_member)
    <570>   DW_AT_name        : (indirect string, offset: 0x1793): CR2
    <574>   DW_AT_type        : <0x236>
    <578>   DW_AT_decl_file   : 4
    <579>   DW_AT_decl_line   : 426
    <57b>   DW_AT_alignment   : 4
    <57c>   DW_AT_data_member_location: 16
 <2><57d>: Abbrev Number: 12 (DW_TAG_member)
    <57e>   DW_AT_name        : (indirect string, offset: 0x1bcc): CR3
    <582>   DW_AT_type        : <0x236>
    <586>   DW_AT_decl_file   : 4
    <587>   DW_AT_decl_line   : 426
    <589>   DW_AT_alignment   : 4
    <58a>   DW_AT_data_member_location: 20
 <2><58b>: Abbrev Number: 12 (DW_TAG_member)
    <58c>   DW_AT_name        : (indirect string, offset: 0x1aa2): GTPR
    <590>   DW_AT_type        : <0x236>
    <594>   DW_AT_decl_file   : 4
    <595>   DW_AT_decl_line   : 426
    <597>   DW_AT_alignment   : 4
    <598>   DW_AT_data_member_location: 24
 <2><599>: Abbrev Number: 0
 <1><59a>: Abbrev Number: 13 (DW_TAG_variable)
    <59b>   DW_AT_name        : (indirect string, offset: 0xfbb): GPIOC_BASE
    <59f>   DW_AT_type        : <0x4ed>
    <5a3>   DW_AT_decl_file   : 4
    <5a4>   DW_AT_decl_line   : 385
    <5a6>   DW_AT_linkage_name: (indirect string, offset: 0xfbb): GPIOC_BASE
 <1><5aa>: Abbrev Number: 13 (DW_TAG_variable)
    <5ab>   DW_AT_name        : (indirect string, offset: 0x1bd0): GPIOC
    <5af>   DW_AT_type        : <0x5ba>
    <5b3>   DW_AT_decl_file   : 4
    <5b4>   DW_AT_decl_line   : 386
    <5b6>   DW_AT_linkage_name: (indirect string, offset: 0x1bd0): GPIOC
 <1><5ba>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <5bb>   DW_AT_type        : <0x5c3>
    <5bf>   DW_AT_name        : (indirect string, offset: 0xda): *stm32f103.GPIO_t
 <1><5c3>: Abbrev Number: 11 (DW_TAG_structure_type)
    <5c4>   DW_AT_name        : (indirect string, offset: 0x1090): stm32f103.GPIO_t
    <5c8>   DW_AT_byte_size   : 28
    <5c9>   DW_AT_decl_file   : 4
    <5ca>   DW_AT_decl_line   : 371
    <5cc>   DW_AT_alignment   : 1
 <2><5cd>: Abbrev Number: 12 (DW_TAG_member)
    <5ce>   DW_AT_name        : (indirect string, offset: 0x19e4): CR
    <5d2>   DW_AT_type        : <0x622>
    <5d6>   DW_AT_decl_file   : 4
    <5d7>   DW_AT_decl_line   : 372
    <5d9>   DW_AT_alignment   : 4
    <5da>   DW_AT_data_member_location: 0
 <2><5db>: Abbrev Number: 12 (DW_TAG_member)
    <5dc>   DW_AT_name        : (indirect string, offset: 0x15cf): IDR
    <5e0>   DW_AT_type        : <0x236>
    <5e4>   DW_AT_decl_file   : 4
    <5e5>   DW_AT_decl_line   : 373
    <5e7>   DW_AT_alignment   : 4
    <5e8>   DW_AT_data_member_location: 8
 <2><5e9>: Abbrev Number: 12 (DW_TAG_member)
    <5ea>   DW_AT_name        : (indirect string, offset: 0xc6f): ODR
    <5ee>   DW_AT_type        : <0x236>
    <5f2>   DW_AT_decl_file   : 4
    <5f3>   DW_AT_decl_line   : 374
    <5f5>   DW_AT_alignment   : 4
    <5f6>   DW_AT_data_member_location: 12
 <2><5f7>: Abbrev Number: 12 (DW_TAG_member)
    <5f8>   DW_AT_name        : (indirect string, offset: 0x1371): BSRR
    <5fc>   DW_AT_type        : <0x236>
    <600>   DW_AT_decl_file   : 4
    <601>   DW_AT_decl_line   : 375
    <603>   DW_AT_alignment   : 4
    <604>   DW_AT_data_member_location: 16
 <2><605>: Abbrev Number: 12 (DW_TAG_member)
    <606>   DW_AT_name        : (indirect string, offset: 0xd6): BRR
    <60a>   DW_AT_type        : <0x236>
    <60e>   DW_AT_decl_file   : 4
    <60f>   DW_AT_decl_line   : 376
    <611>   DW_AT_alignment   : 4
    <612>   DW_AT_data_member_location: 20
 <2><613>: Abbrev Number: 12 (DW_TAG_member)
    <614>   DW_AT_name        : (indirect string, offset: 0x1aa7): LCKR
    <618>   DW_AT_type        : <0x236>
    <61c>   DW_AT_decl_file   : 4
    <61d>   DW_AT_decl_line   : 377
    <61f>   DW_AT_alignment   : 4
    <620>   DW_AT_data_member_location: 24
 <2><621>: Abbrev Number: 0
 <1><622>: Abbrev Number: 14 (DW_TAG_array_type)
    <623>   DW_AT_type        : <0x236>
 <2><627>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <628>   DW_AT_type        : <0x4cf>
    <62c>   DW_AT_count       : 2
 <2><62d>: Abbrev Number: 0
 <1><62e>: Abbrev Number: 2 (DW_TAG_variable)
    <62f>   DW_AT_name        : (indirect string, offset: 0x15d3): ledGreen
    <633>   DW_AT_type        : <0x63d>
    <637>   DW_AT_decl_file   : 6
    <638>   DW_AT_decl_line   : 18
    <639>   DW_AT_linkage_name: (indirect string, offset: 0x15d3): ledGreen
 <1><63d>: Abbrev Number: 6 (DW_TAG_structure_type)
    <63e>   DW_AT_name        : (indirect string, offset: 0x1aac): gpio.Pin
    <642>   DW_AT_byte_size   : 8
    <643>   DW_AT_decl_file   : 5
    <644>   DW_AT_decl_line   : 25
    <645>   DW_AT_alignment   : 4
 <2><646>: Abbrev Number: 8 (DW_TAG_member)
    <647>   DW_AT_name        : (indirect string, offset: 0x175): gpio
    <64b>   DW_AT_type        : <0x5ba>
    <64f>   DW_AT_decl_file   : 5
    <650>   DW_AT_decl_line   : 26
    <651>   DW_AT_alignment   : 4
    <652>   DW_AT_data_member_location: 0
 <2><653>: Abbrev Number: 8 (DW_TAG_member)
    <654>   DW_AT_name        : (indirect string, offset: 0xc73): nr
    <658>   DW_AT_type        : <0x661>
    <65c>   DW_AT_decl_file   : 5
    <65d>   DW_AT_decl_line   : 27
    <65e>   DW_AT_alignment   : 1
    <65f>   DW_AT_data_member_location: 4
 <2><660>: Abbrev Number: 0
 <1><661>: Abbrev Number: 5 (DW_TAG_base_type)
    <662>   DW_AT_name        : (indirect string, offset: 0x1f2f): u4
    <666>   DW_AT_encoding    : 7	(unsigned)
    <667>   DW_AT_byte_size   : 1
 <1><668>: Abbrev Number: 13 (DW_TAG_variable)
    <669>   DW_AT_name        : (indirect string, offset: 0xa3e): AHBPERIPH_BASE
    <66d>   DW_AT_type        : <0x4ed>
    <671>   DW_AT_decl_file   : 4
    <672>   DW_AT_decl_line   : 307
    <674>   DW_AT_linkage_name: (indirect string, offset: 0xa3e): AHBPERIPH_BASE
 <1><678>: Abbrev Number: 13 (DW_TAG_variable)
    <679>   DW_AT_name        : (indirect string, offset: 0x196a): RCC_BASE
    <67d>   DW_AT_type        : <0x4ed>
    <681>   DW_AT_decl_file   : 4
    <682>   DW_AT_decl_line   : 407
    <684>   DW_AT_linkage_name: (indirect string, offset: 0x196a): RCC_BASE
 <1><688>: Abbrev Number: 13 (DW_TAG_variable)
    <689>   DW_AT_name        : (indirect string, offset: 0x45): RCC
    <68d>   DW_AT_type        : <0x698>
    <691>   DW_AT_decl_file   : 4
    <692>   DW_AT_decl_line   : 408
    <694>   DW_AT_linkage_name: (indirect string, offset: 0x45): RCC
 <1><698>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <699>   DW_AT_type        : <0x6a1>
    <69d>   DW_AT_name        : (indirect string, offset: 0x61e): *stm32f103.RCC_t
 <1><6a1>: Abbrev Number: 11 (DW_TAG_structure_type)
    <6a2>   DW_AT_name        : (indirect string, offset: 0x1973): stm32f103.RCC_t
    <6a6>   DW_AT_byte_size   : 40
    <6a7>   DW_AT_decl_file   : 4
    <6a8>   DW_AT_decl_line   : 395
    <6aa>   DW_AT_alignment   : 1
 <2><6ab>: Abbrev Number: 12 (DW_TAG_member)
    <6ac>   DW_AT_name        : (indirect string, offset: 0x19e4): CR
    <6b0>   DW_AT_type        : <0x236>
    <6b4>   DW_AT_decl_file   : 4
    <6b5>   DW_AT_decl_line   : 396
    <6b7>   DW_AT_alignment   : 4
    <6b8>   DW_AT_data_member_location: 0
 <2><6b9>: Abbrev Number: 12 (DW_TAG_member)
    <6ba>   DW_AT_name        : (indirect string, offset: 0xeca): CFGR
    <6be>   DW_AT_type        : <0x236>
    <6c2>   DW_AT_decl_file   : 4
    <6c3>   DW_AT_decl_line   : 397
    <6c5>   DW_AT_alignment   : 4
    <6c6>   DW_AT_data_member_location: 4
 <2><6c7>: Abbrev Number: 12 (DW_TAG_member)
    <6c8>   DW_AT_name        : (indirect string, offset: 0x299): CIR
    <6cc>   DW_AT_type        : <0x236>
    <6d0>   DW_AT_decl_file   : 4
    <6d1>   DW_AT_decl_line   : 398
    <6d3>   DW_AT_alignment   : 4
    <6d4>   DW_AT_data_member_location: 8
 <2><6d5>: Abbrev Number: 12 (DW_TAG_member)
    <6d6>   DW_AT_name        : (indirect string, offset: 0x75d): APB2RSTR
    <6da>   DW_AT_type        : <0x236>
    <6de>   DW_AT_decl_file   : 4
    <6df>   DW_AT_decl_line   : 399
    <6e1>   DW_AT_alignment   : 4
    <6e2>   DW_AT_data_member_location: 12
 <2><6e3>: Abbrev Number: 12 (DW_TAG_member)
    <6e4>   DW_AT_name        : (indirect string, offset: 0x1b33): APB1RSTR
    <6e8>   DW_AT_type        : <0x236>
    <6ec>   DW_AT_decl_file   : 4
    <6ed>   DW_AT_decl_line   : 400
    <6ef>   DW_AT_alignment   : 4
    <6f0>   DW_AT_data_member_location: 16
 <2><6f1>: Abbrev Number: 12 (DW_TAG_member)
    <6f2>   DW_AT_name        : (indirect string, offset: 0x766): AHBENR
    <6f6>   DW_AT_type        : <0x236>
    <6fa>   DW_AT_decl_file   : 4
    <6fb>   DW_AT_decl_line   : 401
    <6fd>   DW_AT_alignment   : 4
    <6fe>   DW_AT_data_member_location: 20
 <2><6ff>: Abbrev Number: 12 (DW_TAG_member)
    <700>   DW_AT_name        : (indirect string, offset: 0x17a): APB2ENR
    <704>   DW_AT_type        : <0x236>
    <708>   DW_AT_decl_file   : 4
    <709>   DW_AT_decl_line   : 402
    <70b>   DW_AT_alignment   : 4
    <70c>   DW_AT_data_member_location: 24
 <2><70d>: Abbrev Number: 12 (DW_TAG_member)
    <70e>   DW_AT_name        : (indirect string, offset: 0x3eb): APB1ENR
    <712>   DW_AT_type        : <0x236>
    <716>   DW_AT_decl_file   : 4
    <717>   DW_AT_decl_line   : 403
    <719>   DW_AT_alignment   : 4
    <71a>   DW_AT_data_member_location: 28
 <2><71b>: Abbrev Number: 12 (DW_TAG_member)
    <71c>   DW_AT_name        : (indirect string, offset: 0xec): BDCR
    <720>   DW_AT_type        : <0x236>
    <724>   DW_AT_decl_file   : 4
    <725>   DW_AT_decl_line   : 404
    <727>   DW_AT_alignment   : 4
    <728>   DW_AT_data_member_location: 32
 <2><729>: Abbrev Number: 12 (DW_TAG_member)
    <72a>   DW_AT_name        : (indirect string, offset: 0x1f32): CSR
    <72e>   DW_AT_type        : <0x236>
    <732>   DW_AT_decl_file   : 4
    <733>   DW_AT_decl_line   : 405
    <735>   DW_AT_alignment   : 4
    <736>   DW_AT_data_member_location: 36
 <2><737>: Abbrev Number: 0
 <1><738>: Abbrev Number: 13 (DW_TAG_variable)
    <739>   DW_AT_name        : (indirect string, offset: 0x1797): SCS_BASE
    <73d>   DW_AT_type        : <0x236>
    <741>   DW_AT_decl_file   : 4
    <742>   DW_AT_decl_line   : 265
    <744>   DW_AT_linkage_name: (indirect string, offset: 0x1797): SCS_BASE
 <1><748>: Abbrev Number: 13 (DW_TAG_variable)
    <749>   DW_AT_name        : (indirect string, offset: 0x3f3): SCB_BASE
    <74d>   DW_AT_type        : <0x236>
    <751>   DW_AT_decl_file   : 4
    <752>   DW_AT_decl_line   : 289
    <754>   DW_AT_linkage_name: (indirect string, offset: 0x3f3): SCB_BASE
 <1><758>: Abbrev Number: 13 (DW_TAG_variable)
    <759>   DW_AT_name        : (indirect string, offset: 0x1e94): SCB
    <75d>   DW_AT_type        : <0x768>
    <761>   DW_AT_decl_file   : 4
    <762>   DW_AT_decl_line   : 290
    <764>   DW_AT_linkage_name: (indirect string, offset: 0x1e94): SCB
 <1><768>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <769>   DW_AT_type        : <0x771>
    <76d>   DW_AT_name        : (indirect string, offset: 0x401): *stm32f103.SCB_t
 <1><771>: Abbrev Number: 11 (DW_TAG_structure_type)
    <772>   DW_AT_name        : (indirect string, offset: 0x17a6): stm32f103.SCB_t
    <776>   DW_AT_byte_size   : 116
    <777>   DW_AT_decl_file   : 4
    <778>   DW_AT_decl_line   : 267
    <77a>   DW_AT_alignment   : 1
 <2><77b>: Abbrev Number: 12 (DW_TAG_member)
    <77c>   DW_AT_name        : (indirect string, offset: 0x29d): CPUID
    <780>   DW_AT_type        : <0x236>
    <784>   DW_AT_decl_file   : 4
    <785>   DW_AT_decl_line   : 268
    <787>   DW_AT_alignment   : 4
    <788>   DW_AT_data_member_location: 0
 <2><789>: Abbrev Number: 12 (DW_TAG_member)
    <78a>   DW_AT_name        : (indirect string, offset: 0x3fc): ICSR
    <78e>   DW_AT_type        : <0x236>
    <792>   DW_AT_decl_file   : 4
    <793>   DW_AT_decl_line   : 269
    <795>   DW_AT_alignment   : 4
    <796>   DW_AT_data_member_location: 4
 <2><797>: Abbrev Number: 12 (DW_TAG_member)
    <798>   DW_AT_name        : (indirect string, offset: 0x10a1): VTOR
    <79c>   DW_AT_type        : <0x236>
    <7a0>   DW_AT_decl_file   : 4
    <7a1>   DW_AT_decl_line   : 270
    <7a3>   DW_AT_alignment   : 4
    <7a4>   DW_AT_data_member_location: 8
 <2><7a5>: Abbrev Number: 12 (DW_TAG_member)
    <7a6>   DW_AT_name        : (indirect string, offset: 0x1168): AIRCR
    <7aa>   DW_AT_type        : <0x236>
    <7ae>   DW_AT_decl_file   : 4
    <7af>   DW_AT_decl_line   : 271
    <7b1>   DW_AT_alignment   : 4
    <7b2>   DW_AT_data_member_location: 12
 <2><7b3>: Abbrev Number: 12 (DW_TAG_member)
    <7b4>   DW_AT_name        : (indirect string, offset: 0xe1c): SCR
    <7b8>   DW_AT_type        : <0x236>
    <7bc>   DW_AT_decl_file   : 4
    <7bd>   DW_AT_decl_line   : 272
    <7bf>   DW_AT_alignment   : 4
    <7c0>   DW_AT_data_member_location: 16
 <2><7c1>: Abbrev Number: 12 (DW_TAG_member)
    <7c2>   DW_AT_name        : (indirect string, offset: 0x15dc): CCR
    <7c6>   DW_AT_type        : <0x236>
    <7ca>   DW_AT_decl_file   : 4
    <7cb>   DW_AT_decl_line   : 273
    <7cd>   DW_AT_alignment   : 4
    <7ce>   DW_AT_data_member_location: 20
 <2><7cf>: Abbrev Number: 12 (DW_TAG_member)
    <7d0>   DW_AT_name        : (indirect string, offset: 0x182): SHPR
    <7d4>   DW_AT_type        : <0x886>
    <7d8>   DW_AT_decl_file   : 4
    <7d9>   DW_AT_decl_line   : 274
    <7db>   DW_AT_alignment   : 1
    <7dc>   DW_AT_data_member_location: 24
 <2><7dd>: Abbrev Number: 12 (DW_TAG_member)
    <7de>   DW_AT_name        : (indirect string, offset: 0x15e0): SHCSR
    <7e2>   DW_AT_type        : <0x236>
    <7e6>   DW_AT_decl_file   : 4
    <7e7>   DW_AT_decl_line   : 275
    <7e9>   DW_AT_alignment   : 4
    <7ea>   DW_AT_data_member_location: 36
 <2><7eb>: Abbrev Number: 12 (DW_TAG_member)
    <7ec>   DW_AT_name        : (indirect string, offset: 0x1d13): CFSR
    <7f0>   DW_AT_type        : <0x236>
    <7f4>   DW_AT_decl_file   : 4
    <7f5>   DW_AT_decl_line   : 276
    <7f7>   DW_AT_alignment   : 4
    <7f8>   DW_AT_data_member_location: 40
 <2><7f9>: Abbrev Number: 12 (DW_TAG_member)
    <7fa>   DW_AT_name        : (indirect string, offset: 0xba4): HFSR
    <7fe>   DW_AT_type        : <0x236>
    <802>   DW_AT_decl_file   : 4
    <803>   DW_AT_decl_line   : 277
    <805>   DW_AT_alignment   : 4
    <806>   DW_AT_data_member_location: 44
 <2><807>: Abbrev Number: 12 (DW_TAG_member)
    <808>   DW_AT_name        : (indirect string, offset: 0x1bd6): DFSR
    <80c>   DW_AT_type        : <0x236>
    <810>   DW_AT_decl_file   : 4
    <811>   DW_AT_decl_line   : 278
    <813>   DW_AT_alignment   : 4
    <814>   DW_AT_data_member_location: 48
 <2><815>: Abbrev Number: 12 (DW_TAG_member)
    <816>   DW_AT_name        : (indirect string, offset: 0x17a0): MMFAR
    <81a>   DW_AT_type        : <0x236>
    <81e>   DW_AT_decl_file   : 4
    <81f>   DW_AT_decl_line   : 279
    <821>   DW_AT_alignment   : 4
    <822>   DW_AT_data_member_location: 52
 <2><823>: Abbrev Number: 12 (DW_TAG_member)
    <824>   DW_AT_name        : (indirect string, offset: 0xecf): BFAR
    <828>   DW_AT_type        : <0x236>
    <82c>   DW_AT_decl_file   : 4
    <82d>   DW_AT_decl_line   : 280
    <82f>   DW_AT_alignment   : 4
    <830>   DW_AT_data_member_location: 56
 <2><831>: Abbrev Number: 12 (DW_TAG_member)
    <832>   DW_AT_name        : (indirect string, offset: 0x1f36): AFSR
    <836>   DW_AT_type        : <0x236>
    <83a>   DW_AT_decl_file   : 4
    <83b>   DW_AT_decl_line   : 281
    <83d>   DW_AT_alignment   : 4
    <83e>   DW_AT_data_member_location: 60
 <2><83f>: Abbrev Number: 12 (DW_TAG_member)
    <840>   DW_AT_name        : (indirect string, offset: 0x1dab): PFR
    <844>   DW_AT_type        : <0x622>
    <848>   DW_AT_decl_file   : 4
    <849>   DW_AT_decl_line   : 282
    <84b>   DW_AT_alignment   : 4
    <84c>   DW_AT_data_member_location: 64
 <2><84d>: Abbrev Number: 12 (DW_TAG_member)
    <84e>   DW_AT_name        : (indirect string, offset: 0x1daf): DFR
    <852>   DW_AT_type        : <0x236>
    <856>   DW_AT_decl_file   : 4
    <857>   DW_AT_decl_line   : 283
    <859>   DW_AT_alignment   : 4
    <85a>   DW_AT_data_member_location: 72
 <2><85b>: Abbrev Number: 12 (DW_TAG_member)
    <85c>   DW_AT_name        : (indirect string, offset: 0x116e): ADR
    <860>   DW_AT_type        : <0x236>
    <864>   DW_AT_decl_file   : 4
    <865>   DW_AT_decl_line   : 284
    <867>   DW_AT_alignment   : 4
    <868>   DW_AT_data_member_location: 76
 <2><869>: Abbrev Number: 12 (DW_TAG_member)
    <86a>   DW_AT_name        : (indirect string, offset: 0x187): MMFR
    <86e>   DW_AT_type        : <0x892>
    <872>   DW_AT_decl_file   : 4
    <873>   DW_AT_decl_line   : 285
    <875>   DW_AT_alignment   : 4
    <876>   DW_AT_data_member_location: 80
 <2><877>: Abbrev Number: 12 (DW_TAG_member)
    <878>   DW_AT_name        : (indirect string, offset: 0xba9): ISAR
    <87c>   DW_AT_type        : <0x89e>
    <880>   DW_AT_decl_file   : 4
    <881>   DW_AT_decl_line   : 286
    <883>   DW_AT_alignment   : 4
    <884>   DW_AT_data_member_location: 96
 <2><885>: Abbrev Number: 0
 <1><886>: Abbrev Number: 14 (DW_TAG_array_type)
    <887>   DW_AT_type        : <0x4d6>
 <2><88b>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <88c>   DW_AT_type        : <0x4cf>
    <890>   DW_AT_count       : 12
 <2><891>: Abbrev Number: 0
 <1><892>: Abbrev Number: 14 (DW_TAG_array_type)
    <893>   DW_AT_type        : <0x236>
 <2><897>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <898>   DW_AT_type        : <0x4cf>
    <89c>   DW_AT_count       : 4
 <2><89d>: Abbrev Number: 0
 <1><89e>: Abbrev Number: 14 (DW_TAG_array_type)
    <89f>   DW_AT_type        : <0x236>
 <2><8a3>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <8a4>   DW_AT_type        : <0x4cf>
    <8a8>   DW_AT_count       : 5
 <2><8a9>: Abbrev Number: 0
 <1><8aa>: Abbrev Number: 13 (DW_TAG_variable)
    <8ab>   DW_AT_name        : (indirect string, offset: 0x412): FLASH_BASE
    <8af>   DW_AT_type        : <0x236>
    <8b3>   DW_AT_decl_file   : 4
    <8b4>   DW_AT_decl_line   : 303
    <8b6>   DW_AT_linkage_name: (indirect string, offset: 0x412): FLASH_BASE
 <1><8ba>: Abbrev Number: 13 (DW_TAG_variable)
    <8bb>   DW_AT_name        : (indirect string, offset: 0x1bdb): VECT_TAB_OFFSET
    <8bf>   DW_AT_type        : <0x4d6>
    <8c3>   DW_AT_decl_file   : 4
    <8c4>   DW_AT_decl_line   : 304
    <8c6>   DW_AT_linkage_name: (indirect string, offset: 0x1bdb): VECT_TAB_OFFSET
 <1><8ca>: Abbrev Number: 13 (DW_TAG_variable)
    <8cb>   DW_AT_name        : (indirect string, offset: 0x76d): NVIC_BASE
    <8cf>   DW_AT_type        : <0x236>
    <8d3>   DW_AT_decl_file   : 4
    <8d4>   DW_AT_decl_line   : 452
    <8d6>   DW_AT_linkage_name: (indirect string, offset: 0x76d): NVIC_BASE
 <1><8da>: Abbrev Number: 13 (DW_TAG_variable)
    <8db>   DW_AT_name        : (indirect string, offset: 0x41d): NVIC
    <8df>   DW_AT_type        : <0x8ea>
    <8e3>   DW_AT_decl_file   : 4
    <8e4>   DW_AT_decl_line   : 453
    <8e6>   DW_AT_linkage_name: (indirect string, offset: 0x41d): NVIC
 <1><8ea>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <8eb>   DW_AT_type        : <0x8f3>
    <8ef>   DW_AT_name        : (indirect string, offset: 0x10d0): *stm32f103.NVIC_t
 <1><8f3>: Abbrev Number: 18 (DW_TAG_structure_type)
    <8f4>   DW_AT_name        : (indirect string, offset: 0x10bf): stm32f103.NVIC_t
    <8f8>   DW_AT_byte_size   : 856
    <8fa>   DW_AT_decl_file   : 4
    <8fb>   DW_AT_decl_line   : 437
    <8fd>   DW_AT_alignment   : 1
 <2><8fe>: Abbrev Number: 12 (DW_TAG_member)
    <8ff>   DW_AT_name        : (indirect string, offset: 0x1983): ISER
    <903>   DW_AT_type        : <0x9af>
    <907>   DW_AT_decl_file   : 4
    <908>   DW_AT_decl_line   : 438
    <90a>   DW_AT_alignment   : 4
    <90b>   DW_AT_data_member_location: 0
 <2><90c>: Abbrev Number: 12 (DW_TAG_member)
    <90d>   DW_AT_name        : (indirect string, offset: 0x1376): reserved1
    <911>   DW_AT_type        : <0x9bb>
    <915>   DW_AT_decl_file   : 4
    <916>   DW_AT_decl_line   : 439
    <918>   DW_AT_alignment   : 1
    <919>   DW_AT_data_member_location: 12
 <2><91a>: Abbrev Number: 12 (DW_TAG_member)
    <91b>   DW_AT_name        : (indirect string, offset: 0x2a3): ICER
    <91f>   DW_AT_type        : <0x9af>
    <923>   DW_AT_decl_file   : 4
    <924>   DW_AT_decl_line   : 440
    <926>   DW_AT_alignment   : 4
    <927>   DW_AT_data_member_location: 128
 <2><928>: Abbrev Number: 12 (DW_TAG_member)
    <929>   DW_AT_name        : (indirect string, offset: 0x10a6): reserved2
    <92d>   DW_AT_type        : <0x9bb>
    <931>   DW_AT_decl_file   : 4
    <932>   DW_AT_decl_line   : 441
    <934>   DW_AT_alignment   : 1
    <935>   DW_AT_data_member_location: 140
 <2><936>: Abbrev Number: 19 (DW_TAG_member)
    <937>   DW_AT_name        : (indirect string, offset: 0x10b0): ISPR
    <93b>   DW_AT_type        : <0x9af>
    <93f>   DW_AT_decl_file   : 4
    <940>   DW_AT_decl_line   : 442
    <942>   DW_AT_alignment   : 4
    <943>   DW_AT_data_member_location: 256
 <2><945>: Abbrev Number: 19 (DW_TAG_member)
    <946>   DW_AT_name        : (indirect string, offset: 0x10b5): reserved3
    <94a>   DW_AT_type        : <0x9bb>
    <94e>   DW_AT_decl_file   : 4
    <94f>   DW_AT_decl_line   : 443
    <951>   DW_AT_alignment   : 1
    <952>   DW_AT_data_member_location: 268
 <2><954>: Abbrev Number: 19 (DW_TAG_member)
    <955>   DW_AT_name        : (indirect string, offset: 0xf1): ICPR
    <959>   DW_AT_type        : <0x9af>
    <95d>   DW_AT_decl_file   : 4
    <95e>   DW_AT_decl_line   : 444
    <960>   DW_AT_alignment   : 4
    <961>   DW_AT_data_member_location: 384
 <2><963>: Abbrev Number: 19 (DW_TAG_member)
    <964>   DW_AT_name        : (indirect string, offset: 0xfc6): reserved4
    <968>   DW_AT_type        : <0x9bb>
    <96c>   DW_AT_decl_file   : 4
    <96d>   DW_AT_decl_line   : 445
    <96f>   DW_AT_alignment   : 1
    <970>   DW_AT_data_member_location: 396
 <2><972>: Abbrev Number: 19 (DW_TAG_member)
    <973>   DW_AT_name        : (indirect string, offset: 0x62f): IABR
    <977>   DW_AT_type        : <0x9af>
    <97b>   DW_AT_decl_file   : 4
    <97c>   DW_AT_decl_line   : 446
    <97e>   DW_AT_alignment   : 4
    <97f>   DW_AT_data_member_location: 512
 <2><981>: Abbrev Number: 19 (DW_TAG_member)
    <982>   DW_AT_name        : (indirect string, offset: 0x1380): reserved5
    <986>   DW_AT_type        : <0x9c7>
    <98a>   DW_AT_decl_file   : 4
    <98b>   DW_AT_decl_line   : 447
    <98d>   DW_AT_alignment   : 1
    <98e>   DW_AT_data_member_location: 524
 <2><990>: Abbrev Number: 19 (DW_TAG_member)
    <991>   DW_AT_name        : (indirect string, offset: 0x49): IPR
    <995>   DW_AT_type        : <0x9d3>
    <999>   DW_AT_decl_file   : 4
    <99a>   DW_AT_decl_line   : 448
    <99c>   DW_AT_alignment   : 1
    <99d>   DW_AT_data_member_location: 768
 <2><99f>: Abbrev Number: 19 (DW_TAG_member)
    <9a0>   DW_AT_name        : (indirect string, offset: 0x903): STIR
    <9a4>   DW_AT_type        : <0x236>
    <9a8>   DW_AT_decl_file   : 4
    <9a9>   DW_AT_decl_line   : 449
    <9ab>   DW_AT_alignment   : 4
    <9ac>   DW_AT_data_member_location: 852
 <2><9ae>: Abbrev Number: 0
 <1><9af>: Abbrev Number: 14 (DW_TAG_array_type)
    <9b0>   DW_AT_type        : <0x236>
 <2><9b4>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <9b5>   DW_AT_type        : <0x4cf>
    <9b9>   DW_AT_count       : 3
 <2><9ba>: Abbrev Number: 0
 <1><9bb>: Abbrev Number: 14 (DW_TAG_array_type)
    <9bc>   DW_AT_type        : <0x4d6>
 <2><9c0>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <9c1>   DW_AT_type        : <0x4cf>
    <9c5>   DW_AT_count       : 116
 <2><9c6>: Abbrev Number: 0
 <1><9c7>: Abbrev Number: 14 (DW_TAG_array_type)
    <9c8>   DW_AT_type        : <0x4d6>
 <2><9cc>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <9cd>   DW_AT_type        : <0x4cf>
    <9d1>   DW_AT_count       : 244
 <2><9d2>: Abbrev Number: 0
 <1><9d3>: Abbrev Number: 14 (DW_TAG_array_type)
    <9d4>   DW_AT_type        : <0x4d6>
 <2><9d8>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <9d9>   DW_AT_type        : <0x4cf>
    <9dd>   DW_AT_count       : 84
 <2><9de>: Abbrev Number: 0
 <1><9df>: Abbrev Number: 13 (DW_TAG_variable)
    <9e0>   DW_AT_name        : (indirect string, offset: 0xbae): STK_BASE
    <9e4>   DW_AT_type        : <0x236>
    <9e8>   DW_AT_decl_file   : 4
    <9e9>   DW_AT_decl_line   : 299
    <9eb>   DW_AT_linkage_name: (indirect string, offset: 0xbae): STK_BASE
 <1><9ef>: Abbrev Number: 13 (DW_TAG_variable)
    <9f0>   DW_AT_name        : (indirect string, offset: 0xa4d): STK
    <9f4>   DW_AT_type        : <0x9ff>
    <9f8>   DW_AT_decl_file   : 4
    <9f9>   DW_AT_decl_line   : 300
    <9fb>   DW_AT_linkage_name: (indirect string, offset: 0xa4d): STK
 <1><9ff>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <a00>   DW_AT_type        : <0xa08>
    <a04>   DW_AT_name        : (indirect string, offset: 0x634): *stm32f103.STK_t
 <1><a08>: Abbrev Number: 11 (DW_TAG_structure_type)
    <a09>   DW_AT_name        : (indirect string, offset: 0x1bef): stm32f103.STK_t
    <a0d>   DW_AT_byte_size   : 16
    <a0e>   DW_AT_decl_file   : 4
    <a0f>   DW_AT_decl_line   : 292
    <a11>   DW_AT_alignment   : 1
 <2><a12>: Abbrev Number: 12 (DW_TAG_member)
    <a13>   DW_AT_name        : (indirect string, offset: 0x1db3): CTRL
    <a17>   DW_AT_type        : <0x236>
    <a1b>   DW_AT_decl_file   : 4
    <a1c>   DW_AT_decl_line   : 293
    <a1e>   DW_AT_alignment   : 4
    <a1f>   DW_AT_data_member_location: 0
 <2><a20>: Abbrev Number: 12 (DW_TAG_member)
    <a21>   DW_AT_name        : (indirect string, offset: 0xfd0): LOAD
    <a25>   DW_AT_type        : <0x236>
    <a29>   DW_AT_decl_file   : 4
    <a2a>   DW_AT_decl_line   : 294
    <a2c>   DW_AT_alignment   : 4
    <a2d>   DW_AT_data_member_location: 4
 <2><a2e>: Abbrev Number: 12 (DW_TAG_member)
    <a2f>   DW_AT_name        : (indirect string, offset: 0x1beb): VAL
    <a33>   DW_AT_type        : <0x236>
    <a37>   DW_AT_decl_file   : 4
    <a38>   DW_AT_decl_line   : 295
    <a3a>   DW_AT_alignment   : 4
    <a3b>   DW_AT_data_member_location: 8
 <2><a3c>: Abbrev Number: 12 (DW_TAG_member)
    <a3d>   DW_AT_name        : (indirect string, offset: 0xed4): CALIB
    <a41>   DW_AT_type        : <0x236>
    <a45>   DW_AT_decl_file   : 4
    <a46>   DW_AT_decl_line   : 296
    <a48>   DW_AT_alignment   : 4
    <a49>   DW_AT_data_member_location: 12
 <2><a4a>: Abbrev Number: 0
 <1><a4b>: Abbrev Number: 13 (DW_TAG_variable)
    <a4c>   DW_AT_name        : (indirect string, offset: 0x1db8): RCC_CR_HSEON
    <a50>   DW_AT_type        : <0x236>
    <a54>   DW_AT_decl_file   : 4
    <a55>   DW_AT_decl_line   : 349
    <a57>   DW_AT_linkage_name: (indirect string, offset: 0x1db8): RCC_CR_HSEON
 <1><a5b>: Abbrev Number: 13 (DW_TAG_variable)
    <a5c>   DW_AT_name        : (indirect string, offset: 0x18c): RCC_CR_HSERDY
    <a60>   DW_AT_type        : <0x236>
    <a64>   DW_AT_decl_file   : 4
    <a65>   DW_AT_decl_line   : 350
    <a67>   DW_AT_linkage_name: (indirect string, offset: 0x18c): RCC_CR_HSERDY
 <1><a6b>: Abbrev Number: 13 (DW_TAG_variable)
    <a6c>   DW_AT_name        : (indirect string, offset: 0x17b6): HSE_STARTUP_TIMEOUT
    <a70>   DW_AT_type        : <0xa7b>
    <a74>   DW_AT_decl_file   : 4
    <a75>   DW_AT_decl_line   : 351
    <a77>   DW_AT_linkage_name: (indirect string, offset: 0x17b6): HSE_STARTUP_TIMEOUT
 <1><a7b>: Abbrev Number: 5 (DW_TAG_base_type)
    <a7c>   DW_AT_name        : (indirect string, offset: 0x9b6): u16
    <a80>   DW_AT_encoding    : 7	(unsigned)
    <a81>   DW_AT_byte_size   : 2
 <1><a82>: Abbrev Number: 13 (DW_TAG_variable)
    <a83>   DW_AT_name        : (indirect string, offset: 0x19e7): RESET
    <a87>   DW_AT_type        : <0x4d6>
    <a8b>   DW_AT_decl_file   : 4
    <a8c>   DW_AT_decl_line   : 352
    <a8e>   DW_AT_linkage_name: (indirect string, offset: 0x19e7): RESET
 <1><a92>: Abbrev Number: 13 (DW_TAG_variable)
    <a93>   DW_AT_name        : (indirect string, offset: 0x19ed): FLASH_R_BASE
    <a97>   DW_AT_type        : <0x236>
    <a9b>   DW_AT_decl_file   : 4
    <a9c>   DW_AT_decl_line   : 422
    <a9e>   DW_AT_linkage_name: (indirect string, offset: 0x19ed): FLASH_R_BASE
 <1><aa2>: Abbrev Number: 13 (DW_TAG_variable)
    <aa3>   DW_AT_name        : (indirect string, offset: 0x19fa): FLASH
    <aa7>   DW_AT_type        : <0xab2>
    <aab>   DW_AT_decl_file   : 4
    <aac>   DW_AT_decl_line   : 423
    <aae>   DW_AT_linkage_name: (indirect string, offset: 0x19fa): FLASH
 <1><ab2>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <ab3>   DW_AT_type        : <0xabb>
    <ab7>   DW_AT_name        : (indirect string, offset: 0x9ba): *stm32f103.FLASH_t
 <1><abb>: Abbrev Number: 11 (DW_TAG_structure_type)
    <abc>   DW_AT_name        : (indirect string, offset: 0x1a00): stm32f103.FLASH_t
    <ac0>   DW_AT_byte_size   : 36
    <ac1>   DW_AT_decl_file   : 4
    <ac2>   DW_AT_decl_line   : 410
    <ac4>   DW_AT_alignment   : 1
 <2><ac5>: Abbrev Number: 12 (DW_TAG_member)
    <ac6>   DW_AT_name        : (indirect string, offset: 0x1860): ACR
    <aca>   DW_AT_type        : <0x236>
    <ace>   DW_AT_decl_file   : 4
    <acf>   DW_AT_decl_line   : 411
    <ad1>   DW_AT_alignment   : 4
    <ad2>   DW_AT_data_member_location: 0
 <2><ad3>: Abbrev Number: 12 (DW_TAG_member)
    <ad4>   DW_AT_name        : (indirect string, offset: 0xc76): KEYR
    <ad8>   DW_AT_type        : <0x236>
    <adc>   DW_AT_decl_file   : 4
    <add>   DW_AT_decl_line   : 412
    <adf>   DW_AT_alignment   : 4
    <ae0>   DW_AT_data_member_location: 4
 <2><ae1>: Abbrev Number: 12 (DW_TAG_member)
    <ae2>   DW_AT_name        : (indirect string, offset: 0x645): OPTKEYR
    <ae6>   DW_AT_type        : <0x236>
    <aea>   DW_AT_decl_file   : 4
    <aeb>   DW_AT_decl_line   : 413
    <aed>   DW_AT_alignment   : 4
    <aee>   DW_AT_data_member_location: 8
 <2><aef>: Abbrev Number: 12 (DW_TAG_member)
    <af0>   DW_AT_name        : (indirect string, offset: 0xba1): SR
    <af4>   DW_AT_type        : <0x236>
    <af8>   DW_AT_decl_file   : 4
    <af9>   DW_AT_decl_line   : 414
    <afb>   DW_AT_alignment   : 4
    <afc>   DW_AT_data_member_location: 12
 <2><afd>: Abbrev Number: 12 (DW_TAG_member)
    <afe>   DW_AT_name        : (indirect string, offset: 0x19e4): CR
    <b02>   DW_AT_type        : <0x236>
    <b06>   DW_AT_decl_file   : 4
    <b07>   DW_AT_decl_line   : 415
    <b09>   DW_AT_alignment   : 4
    <b0a>   DW_AT_data_member_location: 16
 <2><b0b>: Abbrev Number: 12 (DW_TAG_member)
    <b0c>   DW_AT_name        : (indirect string, offset: 0x908): AR
    <b10>   DW_AT_type        : <0x236>
    <b14>   DW_AT_decl_file   : 4
    <b15>   DW_AT_decl_line   : 416
    <b17>   DW_AT_alignment   : 4
    <b18>   DW_AT_data_member_location: 20
 <2><b19>: Abbrev Number: 12 (DW_TAG_member)
    <b1a>   DW_AT_name        : (indirect string, offset: 0x1ab5): RESERVED
    <b1e>   DW_AT_type        : <0x236>
    <b22>   DW_AT_decl_file   : 4
    <b23>   DW_AT_decl_line   : 417
    <b25>   DW_AT_alignment   : 4
    <b26>   DW_AT_data_member_location: 24
 <2><b27>: Abbrev Number: 12 (DW_TAG_member)
    <b28>   DW_AT_name        : (indirect string, offset: 0xe20): OBR
    <b2c>   DW_AT_type        : <0x236>
    <b30>   DW_AT_decl_file   : 4
    <b31>   DW_AT_decl_line   : 418
    <b33>   DW_AT_alignment   : 4
    <b34>   DW_AT_data_member_location: 28
 <2><b35>: Abbrev Number: 12 (DW_TAG_member)
    <b36>   DW_AT_name        : (indirect string, offset: 0x1d18): WRPR
    <b3a>   DW_AT_type        : <0x236>
    <b3e>   DW_AT_decl_file   : 4
    <b3f>   DW_AT_decl_line   : 419
    <b41>   DW_AT_alignment   : 4
    <b42>   DW_AT_data_member_location: 32
 <2><b43>: Abbrev Number: 0
 <1><b44>: Abbrev Number: 13 (DW_TAG_variable)
    <b45>   DW_AT_name        : (indirect string, offset: 0x150d): FLASH_ACR_PRFTBE
    <b49>   DW_AT_type        : <0x4d6>
    <b4d>   DW_AT_decl_file   : 4
    <b4e>   DW_AT_decl_line   : 353
    <b50>   DW_AT_linkage_name: (indirect string, offset: 0x150d): FLASH_ACR_PRFTBE
 <1><b54>: Abbrev Number: 13 (DW_TAG_variable)
    <b55>   DW_AT_name        : (indirect string, offset: 0x19a): FLASH_ACR_LATENCY
    <b59>   DW_AT_type        : <0x4d6>
    <b5d>   DW_AT_decl_file   : 4
    <b5e>   DW_AT_decl_line   : 354
    <b60>   DW_AT_linkage_name: (indirect string, offset: 0x19a): FLASH_ACR_LATENCY
 <1><b64>: Abbrev Number: 13 (DW_TAG_variable)
    <b65>   DW_AT_name        : (indirect string, offset: 0x422): FLASH_ACR_LATENCY_2
    <b69>   DW_AT_type        : <0x4d6>
    <b6d>   DW_AT_decl_file   : 4
    <b6e>   DW_AT_decl_line   : 355
    <b70>   DW_AT_linkage_name: (indirect string, offset: 0x422): FLASH_ACR_LATENCY_2
 <1><b74>: Abbrev Number: 13 (DW_TAG_variable)
    <b75>   DW_AT_name        : (indirect string, offset: 0x15e6): RCC_CFGR_HPRE_DIV1
    <b79>   DW_AT_type        : <0x236>
    <b7d>   DW_AT_decl_file   : 4
    <b7e>   DW_AT_decl_line   : 356
    <b80>   DW_AT_linkage_name: (indirect string, offset: 0x15e6): RCC_CFGR_HPRE_DIV1
 <1><b84>: Abbrev Number: 13 (DW_TAG_variable)
    <b85>   DW_AT_name        : (indirect string, offset: 0x4d): RCC_CFGR_PPRE2_DIV1
    <b89>   DW_AT_type        : <0x236>
    <b8d>   DW_AT_decl_file   : 4
    <b8e>   DW_AT_decl_line   : 357
    <b90>   DW_AT_linkage_name: (indirect string, offset: 0x4d): RCC_CFGR_PPRE2_DIV1
 <1><b94>: Abbrev Number: 13 (DW_TAG_variable)
    <b95>   DW_AT_name        : (indirect string, offset: 0x777): RCC_CFGR_PPRE1_DIV2
    <b99>   DW_AT_type        : <0x236>
    <b9d>   DW_AT_decl_file   : 4
    <b9e>   DW_AT_decl_line   : 358
    <ba0>   DW_AT_linkage_name: (indirect string, offset: 0x777): RCC_CFGR_PPRE1_DIV2
 <1><ba4>: Abbrev Number: 13 (DW_TAG_variable)
    <ba5>   DW_AT_name        : (indirect string, offset: 0xa51): RCC_CFGR_PLLSRC
    <ba9>   DW_AT_type        : <0x236>
    <bad>   DW_AT_decl_file   : 4
    <bae>   DW_AT_decl_line   : 359
    <bb0>   DW_AT_linkage_name: (indirect string, offset: 0xa51): RCC_CFGR_PLLSRC
 <1><bb4>: Abbrev Number: 13 (DW_TAG_variable)
    <bb5>   DW_AT_name        : (indirect string, offset: 0x15f9): RCC_CFGR_PLLXTPRE
    <bb9>   DW_AT_type        : <0x236>
    <bbd>   DW_AT_decl_file   : 4
    <bbe>   DW_AT_decl_line   : 360
    <bc0>   DW_AT_linkage_name: (indirect string, offset: 0x15f9): RCC_CFGR_PLLXTPRE
 <1><bc4>: Abbrev Number: 13 (DW_TAG_variable)
    <bc5>   DW_AT_name        : (indirect string, offset: 0xf6): RCC_CFGR_PLLMULL
    <bc9>   DW_AT_type        : <0x236>
    <bcd>   DW_AT_decl_file   : 4
    <bce>   DW_AT_decl_line   : 361
    <bd0>   DW_AT_linkage_name: (indirect string, offset: 0xf6): RCC_CFGR_PLLMULL
 <1><bd4>: Abbrev Number: 13 (DW_TAG_variable)
    <bd5>   DW_AT_name        : (indirect string, offset: 0x107): RCC_CFGR_PLLSRC_HSE
    <bd9>   DW_AT_type        : <0x236>
    <bdd>   DW_AT_decl_file   : 4
    <bde>   DW_AT_decl_line   : 362
    <be0>   DW_AT_linkage_name: (indirect string, offset: 0x107): RCC_CFGR_PLLSRC_HSE
 <1><be4>: Abbrev Number: 13 (DW_TAG_variable)
    <be5>   DW_AT_name        : (indirect string, offset: 0x1172): RCC_CFGR_PLLMULL9
    <be9>   DW_AT_type        : <0x236>
    <bed>   DW_AT_decl_file   : 4
    <bee>   DW_AT_decl_line   : 364
    <bf0>   DW_AT_linkage_name: (indirect string, offset: 0x1172): RCC_CFGR_PLLMULL9
 <1><bf4>: Abbrev Number: 13 (DW_TAG_variable)
    <bf5>   DW_AT_name        : (indirect string, offset: 0xbb7): RCC_CR_PLLON
    <bf9>   DW_AT_type        : <0x236>
    <bfd>   DW_AT_decl_file   : 4
    <bfe>   DW_AT_decl_line   : 365
    <c00>   DW_AT_linkage_name: (indirect string, offset: 0xbb7): RCC_CR_PLLON
 <1><c04>: Abbrev Number: 13 (DW_TAG_variable)
    <c05>   DW_AT_name        : (indirect string, offset: 0xe24): RCC_CR_PLLRDY
    <c09>   DW_AT_type        : <0x236>
    <c0d>   DW_AT_decl_file   : 4
    <c0e>   DW_AT_decl_line   : 366
    <c10>   DW_AT_linkage_name: (indirect string, offset: 0xe24): RCC_CR_PLLRDY
 <1><c14>: Abbrev Number: 13 (DW_TAG_variable)
    <c15>   DW_AT_name        : (indirect string, offset: 0x1d1d): RCC_CFGR_SW
    <c19>   DW_AT_type        : <0x236>
    <c1d>   DW_AT_decl_file   : 4
    <c1e>   DW_AT_decl_line   : 367
    <c20>   DW_AT_linkage_name: (indirect string, offset: 0x1d1d): RCC_CFGR_SW
 <1><c24>: Abbrev Number: 13 (DW_TAG_variable)
    <c25>   DW_AT_name        : (indirect string, offset: 0x78b): RCC_CFGR_SW_PLL
    <c29>   DW_AT_type        : <0x236>
    <c2d>   DW_AT_decl_file   : 4
    <c2e>   DW_AT_decl_line   : 368
    <c30>   DW_AT_linkage_name: (indirect string, offset: 0x78b): RCC_CFGR_SW_PLL
 <1><c34>: Abbrev Number: 13 (DW_TAG_variable)
    <c35>   DW_AT_name        : (indirect string, offset: 0x1ac): RCC_CFGR_SWS
    <c39>   DW_AT_type        : <0x236>
    <c3d>   DW_AT_decl_file   : 4
    <c3e>   DW_AT_decl_line   : 369
    <c40>   DW_AT_linkage_name: (indirect string, offset: 0x1ac): RCC_CFGR_SWS
 <1><c44>: Abbrev Number: 13 (DW_TAG_variable)
    <c45>   DW_AT_name        : (indirect string, offset: 0x138a): GPIOA_BASE
    <c49>   DW_AT_type        : <0x4ed>
    <c4d>   DW_AT_decl_file   : 4
    <c4e>   DW_AT_decl_line   : 379
    <c50>   DW_AT_linkage_name: (indirect string, offset: 0x138a): GPIOA_BASE
 <1><c54>: Abbrev Number: 13 (DW_TAG_variable)
    <c55>   DW_AT_name        : (indirect string, offset: 0x1d29): GPIOA
    <c59>   DW_AT_type        : <0x5ba>
    <c5d>   DW_AT_decl_file   : 4
    <c5e>   DW_AT_decl_line   : 380
    <c60>   DW_AT_linkage_name: (indirect string, offset: 0x1d29): GPIOA
 <1><c64>: Abbrev Number: 13 (DW_TAG_variable)
    <c65>   DW_AT_name        : (indirect string, offset: 0x151e): GPIOB_BASE
    <c69>   DW_AT_type        : <0x4ed>
    <c6d>   DW_AT_decl_file   : 4
    <c6e>   DW_AT_decl_line   : 382
    <c70>   DW_AT_linkage_name: (indirect string, offset: 0x151e): GPIOB_BASE
 <1><c74>: Abbrev Number: 13 (DW_TAG_variable)
    <c75>   DW_AT_name        : (indirect string, offset: 0x1395): GPIOB
    <c79>   DW_AT_type        : <0x5ba>
    <c7d>   DW_AT_decl_file   : 4
    <c7e>   DW_AT_decl_line   : 383
    <c80>   DW_AT_linkage_name: (indirect string, offset: 0x1395): GPIOB
 <1><c84>: Abbrev Number: 13 (DW_TAG_variable)
    <c85>   DW_AT_name        : (indirect string, offset: 0x436): GPIOD_BASE
    <c89>   DW_AT_type        : <0x4ed>
    <c8d>   DW_AT_decl_file   : 4
    <c8e>   DW_AT_decl_line   : 388
    <c90>   DW_AT_linkage_name: (indirect string, offset: 0x436): GPIOD_BASE
 <1><c94>: Abbrev Number: 13 (DW_TAG_variable)
    <c95>   DW_AT_name        : (indirect string, offset: 0x441): GPIOD
    <c99>   DW_AT_type        : <0x5ba>
    <c9d>   DW_AT_decl_file   : 4
    <c9e>   DW_AT_decl_line   : 389
    <ca0>   DW_AT_linkage_name: (indirect string, offset: 0x441): GPIOD
 <1><ca4>: Abbrev Number: 13 (DW_TAG_variable)
    <ca5>   DW_AT_name        : (indirect string, offset: 0x9cd): GPIOE_BASE
    <ca9>   DW_AT_type        : <0x4ed>
    <cad>   DW_AT_decl_file   : 4
    <cae>   DW_AT_decl_line   : 391
    <cb0>   DW_AT_linkage_name: (indirect string, offset: 0x9cd): GPIOE_BASE
 <1><cb4>: Abbrev Number: 13 (DW_TAG_variable)
    <cb5>   DW_AT_name        : (indirect string, offset: 0x1b3c): GPIOE
    <cb9>   DW_AT_type        : <0x5ba>
    <cbd>   DW_AT_decl_file   : 4
    <cbe>   DW_AT_decl_line   : 392
    <cc0>   DW_AT_linkage_name: (indirect string, offset: 0x1b3c): GPIOE
 <1><cc4>: Abbrev Number: 13 (DW_TAG_variable)
    <cc5>   DW_AT_name        : (indirect string, offset: 0x1529): RCC_APB2Periph_GPIOC
    <cc9>   DW_AT_type        : <0x236>
    <ccd>   DW_AT_decl_file   : 4
    <cce>   DW_AT_decl_line   : 312
    <cd0>   DW_AT_linkage_name: (indirect string, offset: 0x1529): RCC_APB2Periph_GPIOC
 <1><cd4>: Abbrev Number: 13 (DW_TAG_variable)
    <cd5>   DW_AT_name        : (indirect string, offset: 0x447): USART2_BASE
    <cd9>   DW_AT_type        : <0x236>
    <cdd>   DW_AT_decl_file   : 4
    <cde>   DW_AT_decl_line   : 431
    <ce0>   DW_AT_linkage_name: (indirect string, offset: 0x447): USART2_BASE
 <1><ce4>: Abbrev Number: 13 (DW_TAG_variable)
    <ce5>   DW_AT_name        : (indirect string, offset: 0xc7b): USART2
    <ce9>   DW_AT_type        : <0x524>
    <ced>   DW_AT_decl_file   : 4
    <cee>   DW_AT_decl_line   : 432
    <cf0>   DW_AT_linkage_name: (indirect string, offset: 0xc7b): USART2
 <1><cf4>: Abbrev Number: 13 (DW_TAG_variable)
    <cf5>   DW_AT_name        : (indirect string, offset: 0x1e98): USART3_BASE
    <cf9>   DW_AT_type        : <0x236>
    <cfd>   DW_AT_decl_file   : 4
    <cfe>   DW_AT_decl_line   : 434
    <d00>   DW_AT_linkage_name: (indirect string, offset: 0x1e98): USART3_BASE
 <1><d04>: Abbrev Number: 13 (DW_TAG_variable)
    <d05>   DW_AT_name        : (indirect string, offset: 0x1ea4): USART3
    <d09>   DW_AT_type        : <0x524>
    <d0d>   DW_AT_decl_file   : 4
    <d0e>   DW_AT_decl_line   : 435
    <d10>   DW_AT_linkage_name: (indirect string, offset: 0x1ea4): USART3
 <1><d14>: Abbrev Number: 20 (DW_TAG_structure_type)
    <d15>   DW_AT_name        : (indirect string, offset: 0x90b): std.target.arm.cpu
    <d19>   DW_AT_byte_size   : 0
    <d1a>   DW_AT_decl_file   : 7
    <d1b>   DW_AT_decl_line   : 1313
 <2><d1d>: Abbrev Number: 13 (DW_TAG_variable)
    <d1e>   DW_AT_name        : (indirect string, offset: 0xe32): cortex_m3
    <d22>   DW_AT_type        : <0xd2e>
    <d26>   DW_AT_decl_file   : 7
    <d27>   DW_AT_decl_line   : 1788
    <d29>   DW_AT_linkage_name: (indirect string, offset: 0xe32): cortex_m3
 <2><d2d>: Abbrev Number: 0
 <1><d2e>: Abbrev Number: 11 (DW_TAG_structure_type)
    <d2f>   DW_AT_name        : (indirect string, offset: 0x1542): std.target.Model
    <d33>   DW_AT_byte_size   : 40
    <d34>   DW_AT_decl_file   : 3
    <d35>   DW_AT_decl_line   : 932
    <d37>   DW_AT_alignment   : 4
 <2><d38>: Abbrev Number: 12 (DW_TAG_member)
    <d39>   DW_AT_name        : (indirect string, offset: 0xbc4): name
    <d3d>   DW_AT_type        : <0xd65>
    <d41>   DW_AT_decl_file   : 3
    <d42>   DW_AT_decl_line   : 933
    <d44>   DW_AT_alignment   : 4
    <d45>   DW_AT_data_member_location: 0
 <2><d46>: Abbrev Number: 21 (DW_TAG_member)
    <d47>   DW_AT_name        : (indirect string, offset: 0xeda): llvm_name
    <d4b>   DW_AT_type        : <0xd8c>
    <d4f>   DW_AT_decl_file   : 3
    <d50>   DW_AT_decl_line   : 934
    <d52>   DW_AT_byte_size   : 12
    <d53>   DW_AT_bit_size    : 72
    <d54>   DW_AT_bit_offset  : 24
    <d55>   DW_AT_data_member_location: 8
 <2><d56>: Abbrev Number: 12 (DW_TAG_member)
    <d57>   DW_AT_name        : (indirect string, offset: 0x1dc5): features
    <d5b>   DW_AT_type        : <0x473>
    <d5f>   DW_AT_decl_file   : 3
    <d60>   DW_AT_decl_line   : 935
    <d62>   DW_AT_alignment   : 4
    <d63>   DW_AT_data_member_location: 20
 <2><d64>: Abbrev Number: 0
 <1><d65>: Abbrev Number: 22 (DW_TAG_structure_type)
    <d66>   DW_AT_name        : (indirect string, offset: 0x10e2): []u8
    <d6a>   DW_AT_byte_size   : 8
    <d6b>   DW_AT_alignment   : 4
 <2><d6c>: Abbrev Number: 23 (DW_TAG_member)
    <d6d>   DW_AT_name        : (indirect string, offset: 0x153e): ptr
    <d71>   DW_AT_type        : <0xd83>
    <d75>   DW_AT_alignment   : 4
    <d76>   DW_AT_data_member_location: 0
 <2><d77>: Abbrev Number: 23 (DW_TAG_member)
    <d78>   DW_AT_name        : (indirect string, offset: 0x1abe): len
    <d7c>   DW_AT_type        : <0x4c8>
    <d80>   DW_AT_alignment   : 4
    <d81>   DW_AT_data_member_location: 4
 <2><d82>: Abbrev Number: 0
 <1><d83>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <d84>   DW_AT_type        : <0x4d6>
    <d88>   DW_AT_name        : (indirect string, offset: 0x160b): *u8
 <1><d8c>: Abbrev Number: 22 (DW_TAG_structure_type)
    <d8d>   DW_AT_name        : (indirect string, offset: 0xa61): ?[:0]const u8
    <d91>   DW_AT_byte_size   : 12
    <d92>   DW_AT_alignment   : 4
 <2><d93>: Abbrev Number: 23 (DW_TAG_member)
    <d94>   DW_AT_name        : (indirect string, offset: 0x540): val
    <d98>   DW_AT_type        : <0xd65>
    <d9c>   DW_AT_alignment   : 4
    <d9d>   DW_AT_data_member_location: 0
 <2><d9e>: Abbrev Number: 23 (DW_TAG_member)
    <d9f>   DW_AT_name        : (indirect string, offset: 0xe3c): maybe
    <da3>   DW_AT_type        : <0x6c>
    <da7>   DW_AT_alignment   : 1
    <da8>   DW_AT_data_member_location: 8
 <2><da9>: Abbrev Number: 0
 <1><daa>: Abbrev Number: 2 (DW_TAG_variable)
    <dab>   DW_AT_name        : (indirect string, offset: 0x17ca): cpu
    <daf>   DW_AT_type        : <0xdb9>
    <db3>   DW_AT_decl_file   : 2
    <db4>   DW_AT_decl_line   : 11
    <db5>   DW_AT_linkage_name: (indirect string, offset: 0x17ca): cpu
 <1><db9>: Abbrev Number: 11 (DW_TAG_structure_type)
    <dba>   DW_AT_name        : (indirect string, offset: 0x1dce): std.target.Cpu
    <dbe>   DW_AT_byte_size   : 28
    <dbf>   DW_AT_decl_file   : 3
    <dc0>   DW_AT_decl_line   : 454
    <dc2>   DW_AT_alignment   : 4
 <2><dc3>: Abbrev Number: 24 (DW_TAG_member)
    <dc4>   DW_AT_name        : (indirect string, offset: 0x60c): arch
    <dc8>   DW_AT_type        : <0x332>
    <dcc>   DW_AT_decl_file   : 3
    <dcd>   DW_AT_decl_line   : 456
    <dcf>   DW_AT_byte_size   : 0
    <dd0>   DW_AT_bit_size    : 8
    <dd1>   DW_AT_bit_offset  : 0xfffffffffffffffa
    <dd9>   DW_AT_data_member_location: 0x1fffffffffffffff
 <2><de1>: Abbrev Number: 12 (DW_TAG_member)
    <de2>   DW_AT_name        : (indirect string, offset: 0x1eab): model
    <de6>   DW_AT_type        : <0xdfe>
    <dea>   DW_AT_decl_file   : 3
    <deb>   DW_AT_decl_line   : 460
    <ded>   DW_AT_alignment   : 4
    <dee>   DW_AT_data_member_location: 4
 <2><def>: Abbrev Number: 12 (DW_TAG_member)
    <df0>   DW_AT_name        : (indirect string, offset: 0x1dc5): features
    <df4>   DW_AT_type        : <0x473>
    <df8>   DW_AT_decl_file   : 3
    <df9>   DW_AT_decl_line   : 463
    <dfb>   DW_AT_alignment   : 4
    <dfc>   DW_AT_data_member_location: 8
 <2><dfd>: Abbrev Number: 0
 <1><dfe>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <dff>   DW_AT_type        : <0xd2e>
    <e03>   DW_AT_name        : (indirect string, offset: 0x1553): *std.target.Model
 <1><e07>: Abbrev Number: 2 (DW_TAG_variable)
    <e08>   DW_AT_name        : (indirect string, offset: 0x544): abi
    <e0c>   DW_AT_type        : <0xe16>
    <e10>   DW_AT_decl_file   : 2
    <e11>   DW_AT_decl_line   : 10
    <e12>   DW_AT_linkage_name: (indirect string, offset: 0x544): abi
 <1><e16>: Abbrev Number: 3 (DW_TAG_enumeration_type)
    <e17>   DW_AT_type        : <0xe9d>
    <e1b>   DW_AT_name        : (indirect string, offset: 0x1184): std.target.Abi
    <e1f>   DW_AT_byte_size   : 0
    <e20>   DW_AT_decl_file   : 3
    <e21>   DW_AT_decl_line   : 338
    <e23>   DW_AT_alignment   : 1
 <2><e24>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e25>   DW_AT_name        : (indirect string, offset: 0x64d): none
    <e29>   DW_AT_const_value : 0
 <2><e2a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e2b>   DW_AT_name        : (indirect string, offset: 0x9d8): gnu
    <e2f>   DW_AT_const_value : 1
 <2><e30>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e31>   DW_AT_name        : (indirect string, offset: 0x61): gnuabin32
    <e35>   DW_AT_const_value : 2
 <2><e36>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e37>   DW_AT_name        : (indirect string, offset: 0x1864): gnuabi64
    <e3b>   DW_AT_const_value : 3
 <2><e3c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e3d>   DW_AT_name        : (indirect string, offset: 0x1d2f): gnueabi
    <e41>   DW_AT_const_value : 4
 <2><e42>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e43>   DW_AT_name        : (indirect string, offset: 0x1565): gnueabihf
    <e47>   DW_AT_const_value : 5
 <2><e48>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e49>   DW_AT_name        : (indirect string, offset: 0x17ce): gnux32
    <e4d>   DW_AT_const_value : 6
 <2><e4e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e4f>   DW_AT_name        : (indirect string, offset: 0x1a12): code16
    <e53>   DW_AT_const_value : 7
 <2><e54>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e55>   DW_AT_name        : (indirect string, offset: 0x9dc): eabi
    <e59>   DW_AT_const_value : 8
 <2><e5a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e5b>   DW_AT_name        : (indirect string, offset: 0x91e): eabihf
    <e5f>   DW_AT_const_value : 9
 <2><e60>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e61>   DW_AT_name        : (indirect string, offset: 0xa6f): android
    <e65>   DW_AT_const_value : 10
 <2><e66>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e67>   DW_AT_name        : (indirect string, offset: 0x17d5): musl
    <e6b>   DW_AT_const_value : 11
 <2><e6c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e6d>   DW_AT_name        : (indirect string, offset: 0x1988): musleabi
    <e71>   DW_AT_const_value : 12
 <2><e72>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e73>   DW_AT_name        : (indirect string, offset: 0x186d): musleabihf
    <e77>   DW_AT_const_value : 13
 <2><e78>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e79>   DW_AT_name        : (indirect string, offset: 0x11b): msvc
    <e7d>   DW_AT_const_value : 14
 <2><e7e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e7f>   DW_AT_name        : (indirect string, offset: 0x139b): itanium
    <e83>   DW_AT_const_value : 15
 <2><e84>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e85>   DW_AT_name        : (indirect string, offset: 0x1ddd): cygnus
    <e89>   DW_AT_const_value : 16
 <2><e8a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e8b>   DW_AT_name        : (indirect string, offset: 0x1ac2): coreclr
    <e8f>   DW_AT_const_value : 17
 <2><e90>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e91>   DW_AT_name        : (indirect string, offset: 0x453): simulator
    <e95>   DW_AT_const_value : 18
 <2><e96>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e97>   DW_AT_name        : (indirect string, offset: 0x1d37): macabi
    <e9b>   DW_AT_const_value : 19
 <2><e9c>: Abbrev Number: 0
 <1><e9d>: Abbrev Number: 5 (DW_TAG_base_type)
    <e9e>   DW_AT_name        : (indirect string, offset: 0x79b): u5
    <ea2>   DW_AT_encoding    : 7	(unsigned)
    <ea3>   DW_AT_byte_size   : 1
 <1><ea4>: Abbrev Number: 6 (DW_TAG_structure_type)
    <ea5>   DW_AT_name        : (indirect string, offset: 0x120): std.target.Target
    <ea9>   DW_AT_byte_size   : 72
    <eaa>   DW_AT_decl_file   : 3
    <eab>   DW_AT_decl_line   : 9
    <eac>   DW_AT_alignment   : 4
 <2><ead>: Abbrev Number: 8 (DW_TAG_member)
    <eae>   DW_AT_name        : (indirect string, offset: 0x17ca): cpu
    <eb2>   DW_AT_type        : <0xdb9>
    <eb6>   DW_AT_decl_file   : 3
    <eb7>   DW_AT_decl_line   : 10
    <eb8>   DW_AT_alignment   : 4
    <eb9>   DW_AT_data_member_location: 0
 <2><eba>: Abbrev Number: 8 (DW_TAG_member)
    <ebb>   DW_AT_name        : (indirect string, offset: 0x15a7): os
    <ebf>   DW_AT_type        : <0x82>
    <ec3>   DW_AT_decl_file   : 3
    <ec4>   DW_AT_decl_line   : 11
    <ec5>   DW_AT_alignment   : 4
    <ec6>   DW_AT_data_member_location: 28
 <2><ec7>: Abbrev Number: 25 (DW_TAG_member)
    <ec8>   DW_AT_name        : (indirect string, offset: 0x544): abi
    <ecc>   DW_AT_type        : <0xe16>
    <ed0>   DW_AT_decl_file   : 3
    <ed1>   DW_AT_decl_line   : 12
    <ed2>   DW_AT_byte_size   : 0
    <ed3>   DW_AT_bit_size    : 8
    <ed4>   DW_AT_bit_offset  : 0xfffffffffffffff9
    <edc>   DW_AT_data_member_location: 67
 <2><edd>: Abbrev Number: 13 (DW_TAG_variable)
    <ede>   DW_AT_name        : (indirect string, offset: 0x1aca): current
    <ee2>   DW_AT_type        : <0xea4>
    <ee6>   DW_AT_decl_file   : 3
    <ee7>   DW_AT_decl_line   : 999
    <ee9>   DW_AT_linkage_name: (indirect string, offset: 0x1aca): current
 <2><eed>: Abbrev Number: 0
 <1><eee>: Abbrev Number: 13 (DW_TAG_variable)
    <eef>   DW_AT_name        : (indirect string, offset: 0x45d): RCC_APB2Periph_GPIOA
    <ef3>   DW_AT_type        : <0x236>
    <ef7>   DW_AT_decl_file   : 4
    <ef8>   DW_AT_decl_line   : 310
    <efa>   DW_AT_linkage_name: (indirect string, offset: 0x45d): RCC_APB2Periph_GPIOA
 <1><efe>: Abbrev Number: 2 (DW_TAG_variable)
    <eff>   DW_AT_name        : (indirect string, offset: 0x17da): default_max_depth
    <f03>   DW_AT_type        : <0x4d6>
    <f07>   DW_AT_decl_file   : 8
    <f08>   DW_AT_decl_line   : 9
    <f09>   DW_AT_linkage_name: (indirect string, offset: 0x17da): default_max_depth
 <1><f0d>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <f0e>   DW_AT_type        : <0xa7b>
    <f12>   DW_AT_name        : (indirect string, offset: 0x1b42): anyerror
    <f16>   DW_AT_byte_size   : 2
    <f17>   DW_AT_alignment   : 2
 <2><f18>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f19>   DW_AT_name        : (indirect string, offset: 0x1ad2): (none)
    <f1d>   DW_AT_const_value : 0
 <2><f1e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f1f>   DW_AT_name        : (indirect string, offset: 0x652): ParityAndWordsizeNotSupportedByHw
    <f23>   DW_AT_const_value : 1
 <2><f24>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f25>   DW_AT_name        : (indirect string, offset: 0x1193): OutOfMemory
    <f29>   DW_AT_const_value : 2
 <2><f2a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f2b>   DW_AT_name        : (indirect string, offset: 0x2a8): Overflow
    <f2f>   DW_AT_const_value : 3
 <2><f30>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f31>   DW_AT_name        : (indirect string, offset: 0x1ad9): NoSpaceLeft
    <f35>   DW_AT_const_value : 4
 <2><f36>: Abbrev Number: 0
 <1><f37>: Abbrev Number: 9 (DW_TAG_enumeration_type)
    <f38>   DW_AT_type        : <0x4d6>
    <f3c>   DW_AT_name        : (indirect string, offset: 0xe7d): std.target.arm.Feature
    <f40>   DW_AT_byte_size   : 1
    <f41>   DW_AT_decl_file   : 7
    <f42>   DW_AT_decl_line   : 5
    <f43>   DW_AT_alignment   : 1
 <2><f44>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f45>   DW_AT_name        : (indirect string, offset: 0x160f): 32bit
    <f49>   DW_AT_const_value : 0
 <2><f4a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f4b>   DW_AT_name        : (indirect string, offset: 0xa77): 8msecext
    <f4f>   DW_AT_const_value : 1
 <2><f50>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f51>   DW_AT_name        : (indirect string, offset: 0x79e): a76
    <f55>   DW_AT_const_value : 2
 <2><f56>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f57>   DW_AT_name        : (indirect string, offset: 0xa80): aclass
    <f5b>   DW_AT_const_value : 3
 <2><f5c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f5d>   DW_AT_name        : (indirect string, offset: 0xfd5): acquire_release
    <f61>   DW_AT_const_value : 4
 <2><f62>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f63>   DW_AT_name        : (indirect string, offset: 0x132): aes
    <f67>   DW_AT_const_value : 5
 <2><f68>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f69>   DW_AT_name        : (indirect string, offset: 0x2b1): avoid_movs_shop
    <f6d>   DW_AT_const_value : 6
 <2><f6e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f6f>   DW_AT_name        : (indirect string, offset: 0x13a3): avoid_partial_cpsr
    <f73>   DW_AT_const_value : 7
 <2><f74>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f75>   DW_AT_name        : (indirect string, offset: 0x1de4): cheap_predicable_cpsr
    <f79>   DW_AT_const_value : 8
 <2><f7a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f7b>   DW_AT_name        : (indirect string, offset: 0x1991): crc
    <f7f>   DW_AT_const_value : 9
 <2><f80>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f81>   DW_AT_name        : (indirect string, offset: 0x674): crypto
    <f85>   DW_AT_const_value : 10
 <2><f86>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f87>   DW_AT_name        : (indirect string, offset: 0x548): d32
    <f8b>   DW_AT_const_value : 11
 <2><f8c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f8d>   DW_AT_name        : (indirect string, offset: 0x10e7): db
    <f91>   DW_AT_const_value : 12
 <2><f92>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f93>   DW_AT_name        : (indirect string, offset: 0x1b4b): dfb
    <f97>   DW_AT_const_value : 13
 <2><f98>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f99>   DW_AT_name        : (indirect string, offset: 0x7a2): disable_postra_scheduler
    <f9d>   DW_AT_const_value : 14
 <2><f9e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f9f>   DW_AT_name        : (indirect string, offset: 0x1b9): dont_widen_vmovs
    <fa3>   DW_AT_const_value : 15
 <2><fa4>: Abbrev Number: 4 (DW_TAG_enumerator)
    <fa5>   DW_AT_name        : (indirect string, offset: 0x1d3e): dotprod
    <fa9>   DW_AT_const_value : 16
 <2><faa>: Abbrev Number: 4 (DW_TAG_enumerator)
    <fab>   DW_AT_name        : (indirect string, offset: 0x1f3b): dsp
    <faf>   DW_AT_const_value : 17
 <2><fb0>: Abbrev Number: 4 (DW_TAG_enumerator)
    <fb1>   DW_AT_name        : (indirect string, offset: 0x10ea): execute_only
    <fb5>   DW_AT_const_value : 18
 <2><fb6>: Abbrev Number: 4 (DW_TAG_enumerator)
    <fb7>   DW_AT_name        : (indirect string, offset: 0x472): expand_fp_mlx
    <fbb>   DW_AT_const_value : 19
 <2><fbc>: Abbrev Number: 4 (DW_TAG_enumerator)
    <fbd>   DW_AT_name        : (indirect string, offset: 0x1878): exynos
    <fc1>   DW_AT_const_value : 20
 <2><fc2>: Abbrev Number: 4 (DW_TAG_enumerator)
    <fc3>   DW_AT_name        : (indirect string, offset: 0x1615): fp16
    <fc7>   DW_AT_const_value : 21
 <2><fc8>: Abbrev Number: 4 (DW_TAG_enumerator)
    <fc9>   DW_AT_name        : (indirect string, offset: 0xc82): fp16fml
    <fcd>   DW_AT_const_value : 22
 <2><fce>: Abbrev Number: 4 (DW_TAG_enumerator)
    <fcf>   DW_AT_name        : (indirect string, offset: 0x1ae5): fp64
    <fd3>   DW_AT_const_value : 23
 <2><fd4>: Abbrev Number: 4 (DW_TAG_enumerator)
    <fd5>   DW_AT_name        : (indirect string, offset: 0x6b): fp_armv8
    <fd9>   DW_AT_const_value : 24
 <2><fda>: Abbrev Number: 4 (DW_TAG_enumerator)
    <fdb>   DW_AT_name        : (indirect string, offset: 0x119f): fp_armv8d16
    <fdf>   DW_AT_const_value : 25
 <2><fe0>: Abbrev Number: 4 (DW_TAG_enumerator)
    <fe1>   DW_AT_name        : (indirect string, offset: 0x1b4f): fp_armv8d16sp
    <fe5>   DW_AT_const_value : 26
 <2><fe6>: Abbrev Number: 4 (DW_TAG_enumerator)
    <fe7>   DW_AT_name        : (indirect string, offset: 0x17ec): fp_armv8sp
    <feb>   DW_AT_const_value : 27
 <2><fec>: Abbrev Number: 4 (DW_TAG_enumerator)
    <fed>   DW_AT_name        : (indirect string, offset: 0x925): fpao
    <ff1>   DW_AT_const_value : 28
 <2><ff2>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ff3>   DW_AT_name        : (indirect string, offset: 0x17f7): fpregs
    <ff7>   DW_AT_const_value : 29
 <2><ff8>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ff9>   DW_AT_name        : (indirect string, offset: 0xee4): fpregs16
    <ffd>   DW_AT_const_value : 30
 <2><ffe>: Abbrev Number: 4 (DW_TAG_enumerator)
    <fff>   DW_AT_name        : (indirect string, offset: 0xc8a): fpregs64
    <1003>   DW_AT_const_value : 31
 <2><1004>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1005>   DW_AT_name        : (indirect string, offset: 0xa87): fullfp16
    <1009>   DW_AT_const_value : 32
 <2><100a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <100b>   DW_AT_name        : (indirect string, offset: 0x480): fuse_aes
    <100f>   DW_AT_const_value : 33
 <2><1010>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1011>   DW_AT_name        : (indirect string, offset: 0x1aea): fuse_literals
    <1015>   DW_AT_const_value : 34
 <2><1016>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1017>   DW_AT_name        : (indirect string, offset: 0x2c1): has_v4t
    <101b>   DW_AT_const_value : 35
 <2><101c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <101d>   DW_AT_name        : (indirect string, offset: 0x1995): has_v5t
    <1021>   DW_AT_const_value : 36
 <2><1022>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1023>   DW_AT_name        : (indirect string, offset: 0x74): has_v5te
    <1027>   DW_AT_const_value : 37
 <2><1028>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1029>   DW_AT_name        : (indirect string, offset: 0x199d): has_v6
    <102d>   DW_AT_const_value : 38
 <2><102e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <102f>   DW_AT_name        : (indirect string, offset: 0x1d46): has_v6k
    <1033>   DW_AT_const_value : 39
 <2><1034>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1035>   DW_AT_name        : (indirect string, offset: 0xa90): has_v6m
    <1039>   DW_AT_const_value : 40
 <2><103a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <103b>   DW_AT_name        : (indirect string, offset: 0x17fe): has_v6t2
    <103f>   DW_AT_const_value : 41
 <2><1040>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1041>   DW_AT_name        : (indirect string, offset: 0x7d): has_v7
    <1045>   DW_AT_const_value : 42
 <2><1046>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1047>   DW_AT_name        : (indirect string, offset: 0xfe5): has_v7clrex
    <104b>   DW_AT_const_value : 43
 <2><104c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <104d>   DW_AT_name        : (indirect string, offset: 0x67b): has_v8_1a
    <1051>   DW_AT_const_value : 44
 <2><1052>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1053>   DW_AT_name        : (indirect string, offset: 0x2c9): has_v8_1m_main
    <1057>   DW_AT_const_value : 45
 <2><1058>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1059>   DW_AT_name        : (indirect string, offset: 0xc93): has_v8_2a
    <105d>   DW_AT_const_value : 46
 <2><105e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <105f>   DW_AT_name        : (indirect string, offset: 0x1bff): has_v8_3a
    <1063>   DW_AT_const_value : 47
 <2><1064>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1065>   DW_AT_name        : (indirect string, offset: 0x10f7): has_v8_4a
    <1069>   DW_AT_const_value : 48
 <2><106a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <106b>   DW_AT_name        : (indirect string, offset: 0x1f3f): has_v8_5a
    <106f>   DW_AT_const_value : 49
 <2><1070>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1071>   DW_AT_name        : (indirect string, offset: 0x489): has_v8
    <1075>   DW_AT_const_value : 50
 <2><1076>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1077>   DW_AT_name        : (indirect string, offset: 0x1c09): has_v8m
    <107b>   DW_AT_const_value : 51
 <2><107c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <107d>   DW_AT_name        : (indirect string, offset: 0x54c): has_v8m_main
    <1081>   DW_AT_const_value : 52
 <2><1082>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1083>   DW_AT_name        : (indirect string, offset: 0x11ab): hwdiv
    <1087>   DW_AT_const_value : 53
 <2><1088>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1089>   DW_AT_name        : (indirect string, offset: 0x13b6): hwdiv_arm
    <108d>   DW_AT_const_value : 54
 <2><108e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <108f>   DW_AT_name        : (indirect string, offset: 0x11b1): iwmmxt
    <1093>   DW_AT_const_value : 55
 <2><1094>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1095>   DW_AT_name        : (indirect string, offset: 0x1101): iwmmxt2
    <1099>   DW_AT_const_value : 56
 <2><109a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <109b>   DW_AT_name        : (indirect string, offset: 0x1c11): lob
    <109f>   DW_AT_const_value : 57
 <2><10a0>: Abbrev Number: 4 (DW_TAG_enumerator)
    <10a1>   DW_AT_name        : (indirect string, offset: 0x9e1): long_calls
    <10a5>   DW_AT_const_value : 58
 <2><10a6>: Abbrev Number: 4 (DW_TAG_enumerator)
    <10a7>   DW_AT_name        : (indirect string, offset: 0x1dfa): loop_align
    <10ab>   DW_AT_const_value : 59
